rizkyzullfhamy/FireAlarm_Mutant_STM32F4/MDK-ARM/SENSOR.c
/* INCLUDE LIBRARY */
#include "stm32f4xx_hal.h"
#include "main.h"
#include "Header.h"
#include "stdbool.h"
#include "stdio.h"
#include "LCD_Lib.h"
#include "DWT_Delay.h"
#include "String.h"
/* INITIALIZE FUNCTION */
float lowPassFilter(float dataInput, int i);
void getSensor(void);
int scanSensor(void); 
void modeSingleWire(void);
void modeCrossWire(void);
void checkSortAndOpenCircuit(void);
void checkOverCurrentSensor(void);
void modeSingleWire_CobaSaja(void);
void checkSupply(void);
/* VARIABLE */
char bufferrr[100];
char buffer1[50];
float data_vAdc;
float adc_lowpass;
float y[16];
float resistor = 3.3;
float vRef = 3.3;
float currentSegment[16];
float openShortCircuit[16];
float thresholdSegment[16];
int currentOverSensor = 300;
uint8_t dataSeg[16];

// =========================================== //
	 /*		NILAI 0 => AMAN
				NILAI 1 => PRE-ALARM
				NILAI 2 => ALARM/FIRE
	 */
// ========================================== //
/* ========================================== */
/* ========================================== */
/* ============== TODO HERE ================= */
/* ========================================== */
/* ========================================== */
float lowPassFilter(float dataInput, int i){
	float val1 = 0.172;
	float val2 = 0.828;

	y[i] = (val2 * y[i] ) + (val1 * dataInput);
	
	return y[i];
}
void getSensor(void){
	for(int i = 0 ; i < 16; i++){
		adc_lowpass =  lowPassFilter(adcBuffer[i], i);
		data_vAdc = (vRef * adc_lowpass) / 4095;
		currentSegment[i] = (data_vAdc / resistor) * 1000;  
	}
}

int scanSensor(void){
	int count = 0;
	bool flagScan = false;
	if(valueSetInterval <= 0) {valueSetInterval = 50;}		// DEFAULT APABILA TIDAK DIISI
	for (int i = 0; i < 16; i++){
		thresholdSegment[i] = (currentSegment[i] + valueSetInterval) * 0.9;
		openShortCircuit[i] = currentSegment[i] * 0.2; // TOLERANCE 20%
	//	if(openShortCircuit[i] < 0) openShortCircuit[i] = 0;
	}
	
	// CHECKSUM SCAN SENSOR
	for(int i=0; i  < 15; i++){
		if(openShortCircuit[i] == 0 && thresholdSegment[i] < 150) count++;
		
	}
		if(count > 15){
			LCD_Clear();
			LCD_Putsxy(0,0,"SCAN FAILED, TRY AGAIN");
			//sprintf(bufferrr, "%d || %d || %d || %d || %.2f || %.2f", count ,adcBuffer[0], adcBuffer[1], adcBuffer[10], currentSegment[0], currentSegment[1]);
			//LCD_Putsxy(0,1, bufferrr);
			DWT_Delayms(2000);
			LCD_Clear();
			flagScan = false;
		}else{
			LCD_Clear();
			LCD_Putsxy(0,0,"SCAN SUCCESS"); 
			//sprintf(bufferrr,"%d || op :  %.2f || %.2f || %.2f ", valueSetInterval, openShortCircuit[0], openShortCircuit[1], thresholdSegment[0]);
			//LCD_Putsxy(0,1,bufferrr);
			DWT_Delayms(2000);
			LCD_Clear();
			flagScan = true;
		}
	return flagScan;
}

// FITUR
void checkSupply(void){
	bool result[4] = {true, true, true,};
	
	
	result[0] = strcmp(dataF1,"100");			// JIKA SAMA MAKA RETURN 0;		// AMAN
	result[1] = strcmp(dataF1,"101");			// JIKA SAMA MAKA RETURN 0
	result[2] = strcmp(dataF1,"102");			// JIKA SAMA MAKA RETURN 0;
	
	if(!result[0]){
		LCD_Clear();
	}else if(!result[1]){
		LCD_Clear();
		LCD_Putsxy(0,0, "TROUBLE 1 AC POWER LOSS");
		LCD_Putsxy(0, 1, dateTime);
		DWT_Delayms(1000);
		LCD_Clear();
	}else if(!result[2]){
		LCD_Clear();
		LCD_Putsxy(0,0, "TROUBLE 2 BATRAI DISCONNECT");
		LCD_Putsxy(0, 1, dateTime);
		DWT_Delayms(1000);
		LCD_Clear();
	}
}
//void modeSingleWire(void){
//	if(currentSegment[0] > thresholdSegment[0]){
//		/* FIRE ALARM ACTIVE */
//		// AKTIFKAN RELAY
//		relayOn(0);
//		// Data TO SCADA
//		dataSeg[0] = 2;
//		// PESAN KE LCD
//		LCD_Clear();
//		if(strlen(temp1) >= 2){			//check apabila penamaan zone kosong
//			sprintf(buffer1, "ZONE %s AKTIF",temp1);
//			LCD_Putsxy(0,1, buffer1);
//		}else{
//			LCD_Putsxy(0,1, "Segment 1 AKTIF");
//		}
//		LCD_Putsxy(0,1, buffer1);
//		DWT_Delayms(1000);
//		sendDataSegment(); 		// SEND TO F1
//	}else{
//		/* MODE AMAN */
//		dataSeg[0] = 0;		
//		sendDataSegment(); 		// SEND TO F1
//	}
//	if(currentSegment[1] > thresholdSegment[1]){
//		/* FIRE ALARM ACTIVE */
//		// AKTIFKAN RELAY
//		relayOn(1);
//		// Data TO SCADA
//		dataSeg[1] = 2;
//		// PESAN KE LCD
//		LCD_Clear();
//		if(strlen(temp2) >= 2){			//check apabila penamaan zone kosong
//			sprintf(buffer1, "ZONE %s AKTIF",temp2);
//			LCD_Putsxy(0,1, buffer1);
//		}else{
//			LCD_Putsxy(0,1, "Segment 2 AKTIF");
//		}
//		LCD_Putsxy(0,1, buffer1);
//		DWT_Delayms(1000);
//		sendDataSegment(); 		// SEND TO F1
//	}else{
//		/* MODE AMAN */
//		dataSeg[1] = 0;
//		sendDataSegment(); 		// SEND TO F1
//	}
//	if(currentSegment[2] > thresholdSegment[2]){
//		/* FIRE ALARM ACTIVE */
//		// AKTIFKAN RELAY
//		relayOn(2);
//		// Data TO SCADA
//		dataSeg[2] = 2;
//		// PESAN KE LCD
//		LCD_Clear();
//		if(strlen(temp3) >= 2){			//check apabila penamaan zone kosong
//			sprintf(buffer1, "ZONE %s AKTIF",temp3);
//			LCD_Putsxy(0,1, buffer1);
//		}else{
//			LCD_Putsxy(0,1, "Segment 3 AKTIF");
//		}
//		LCD_Putsxy(0,1, buffer1);
//		DWT_Delayms(1000);
//		sendDataSegment(); 		// SEND TO F1
//	}else{
//		/* MODE AMAN */
//		dataSeg[2] = 0;		
//		sendDataSegment(); 		// SEND TO F1
//	}
//	if(currentSegment[3] > thresholdSegment[3]){
//		/* FIRE ALARM ACTIVE */
//		// AKTIFKAN RELAY
//		relayOn(3);
//		// Data TO SCADA
//		dataSeg[3] = 2;
//		// PESAN KE LCD
//		LCD_Clear();
//		if(strlen(temp4) >= 2){			//check apabila penamaan zone kosong
//			sprintf(buffer1, "ZONE %s AKTIF",temp4);
//			LCD_Putsxy(0,1, buffer1);
//		}else{
//			LCD_Putsxy(0,1, "Segment 4 AKTIF");
//		}
//		LCD_Putsxy(0,1, buffer1);
//		DWT_Delayms(1000);
//		sendDataSegment(); 		// SEND TO F1
//	}else{
//		/* MODE AMAN */
//		dataSeg[3] = 0;		
//		sendDataSegment(); 		// SEND TO F1
//	}
//	if(currentSegment[4] > thresholdSegment[4]){
//		/* FIRE ALARM ACTIVE */
//		// AKTIFKAN RELAY
//		relayOn(4);
//		// Data TO SCADA
//		dataSeg[4] = 2;	
//		// PESAN KE LCD
//		LCD_Clear();
//		if(strlen(temp5) >= 2){			//check apabila penamaan zone kosong
//			sprintf(buffer1, "ZONE %s AKTIF",temp5);
//			LCD_Putsxy(0,1, buffer1);
//		}else{
//			LCD_Putsxy(0,1, "Segment 5 AKTIF");
//		}
//		LCD_Putsxy(0,1, buffer1);
//		DWT_Delayms(1000);
//		sendDataSegment(); 		// SEND TO F1
//	}else{
//		/* MODE AMAN */
//		dataSeg[4] = 0;
//		sendDataSegment(); 		// SEND TO F1
//	}
//	if(currentSegment[5] > thresholdSegment[5]){
//		/* FIRE ALARM ACTIVE */
//		// AKTIFKAN RELAY
//		relayOn(5);
//		// Data TO SCADA
//		dataSeg[5] = 2;		
//		// PESAN KE LCD
//		LCD_Clear();
//		if(strlen(temp6) >= 2){			//check apabila penamaan zone kosong
//			sprintf(buffer1, "ZONE %s AKTIF",temp6);
//			LCD_Putsxy(0,1, buffer1);
//		}else{
//			LCD_Putsxy(0,1, "Segment 6 AKTIF");
//		}
//		LCD_Putsxy(0,1, buffer1);
//		DWT_Delayms(1000);
//		sendDataSegment(); 		// SEND TO F1
//	}else{
//		/* MODE AMAN */
//		dataSeg[5] = 0;
//		sendDataSegment(); 		// SEND TO F1
//	}
//	if(currentSegment[6] > thresholdSegment[6]){
//		/* FIRE ALARM ACTIVE */
//		// AKTIFKAN RELAY
//		relayOn(6);
//		// Data TO SCADA
//		dataSeg[6] = 2;		
//		// PESAN KE LCD
//		LCD_Clear();
//		if(strlen(temp7) >= 2){			//check apabila penamaan zone kosong
//			sprintf(buffer1, "ZONE %s AKTIF",temp7);
//			LCD_Putsxy(0,1, buffer1);
//		}else{
//			LCD_Putsxy(0,1, "Segment 7 AKTIF");
//		}
//		LCD_Putsxy(0,1, buffer1);
//		DWT_Delayms(1000);
//		sendDataSegment(); 		// SEND TO F1
//	}else{
//		/* MODE AMAN */
//		dataSeg[6] = 0;		
//		sendDataSegment(); 		// SEND TO F1
//	}
//	if(currentSegment[7] > thresholdSegment[7]){
//		/* FIRE ALARM ACTIVE */
//		// AKTIFKAN RELAY
//		relayOn(7);
//		// Data TO SCADA
//		dataSeg[7] = 2;		
//		// PESAN KE LCD
//		LCD_Clear();
//		if(strlen(temp8) >= 2){			//check apabila penamaan zone kosong
//			sprintf(buffer1, "ZONE %s AKTIF",temp8);
//			LCD_Putsxy(0,1, buffer1);
//		}else{
//			LCD_Putsxy(0,1, "Segment 8 AKTIF");
//		}
//		LCD_Putsxy(0,1, buffer1);
//		DWT_Delayms(1000);
//		sendDataSegment(); 		// SEND TO F1
//	}else{
//		/* MODE AMAN */
//		dataSeg[7] = 0;	
//		sendDataSegment(); 		// SEND TO F1
//	}
//	if(currentSegment[8] > thresholdSegment[8]){
//		/* FIRE ALARM ACTIVE */
//		// AKTIFKAN RELAY
//		relayOn(8);
//		// USART TO SCADA
//		dataSeg[8] = 2;		
//		// PESAN KE LCD
//		LCD_Clear();
//		if(strlen(temp9) >= 2){			//check apabila penamaan zone kosong
//			sprintf(buffer1, "ZONE %s AKTIF",temp9);
//			LCD_Putsxy(0,1, buffer1);
//		}else{
//			LCD_Putsxy(0,1, "Segment 9 AKTIF");
//		}
//		LCD_Putsxy(0,1, buffer1);
//		DWT_Delayms(1000);
//		sendDataSegment(); 		// SEND TO F1
//	}else{
//		/* MODE AMAN */
//		dataSeg[8] = 0;	
//		sendDataSegment(); 		// SEND TO F1
//	}
//	if(currentSegment[9] > thresholdSegment[9]){
//		/* FIRE ALARM ACTIVE */
//		// AKTIFKAN RELAY
//		relayOn(9);
//		// Data TO SCADA
//		dataSeg[9] = 2;		
//		// PESAN KE LCD
//		LCD_Clear();
//		if(strlen(temp10) >= 2){			//check apabila penamaan zone kosong
//			sprintf(buffer1, "ZONE %s AKTIF",temp10);
//			LCD_Putsxy(0,1, buffer1);
//		}else{
//			LCD_Putsxy(0,1, "Segment 10 AKTIF");
//		}
//		LCD_Putsxy(0,1, buffer1);
//		DWT_Delayms(1000);
//		sendDataSegment(); 		// SEND TO F1
//	}else{
//		/* MODE AMAN */
//		dataSeg[9] = 0;		
//		sendDataSegment(); 		// SEND TO F1
//	}
//	if(currentSegment[10] > thresholdSegment[10]){
//		/* FIRE ALARM ACTIVE */
//		// AKTIFKAN RELAY
//		relayOn(10);
//		// Data TO SCADA
//		dataSeg[9] = 2;		
//		// PESAN KE LCD
//		LCD_Clear();
//		if(strlen(temp11) >= 2){			//check apabila penamaan zone kosong
//			sprintf(buffer1, "ZONE %s AKTIF",temp11);
//			LCD_Putsxy(0,1, buffer1);
//		}else{
//			LCD_Putsxy(0,1, "Segment 11 AKTIF");
//		}
//		DWT_Delayms(1000);
//		sendDataSegment(); 		// SEND TO F1
//	}else{
//		/* MODE AMAN */
//		dataSeg[10] = 0;		
//		sendDataSegment(); 		// SEND TO F1		
//	}
//	if(currentSegment[11] > thresholdSegment[11]){
//		/* FIRE ALARM ACTIVE */
//		// AKTIFKAN RELAY
//		relayOn(11);
//		// Data TO SCADA
//		dataSeg[11] = 2;		
//		// PESAN KE LCD
//		LCD_Clear();
//		if(strlen(temp12) >= 2){			//check apabila penamaan zone kosong
//			sprintf(buffer1, "ZONE %s AKTIF",temp12);
//			LCD_Putsxy(0,1, buffer1);
//		}else{
//			LCD_Putsxy(0,1, "Segment 12 AKTIF");
//		}
//		DWT_Delayms(1000);
//		sendDataSegment(); 		// SEND TO F1
//	}else{
//		/* MODE AMAN */
//		dataSeg[11] = 0;			
//		sendDataSegment(); 		// SEND TO F1
//	}
//	if(currentSegment[12] > thresholdSegment[12]){
//		/* FIRE ALARM ACTIVE */
//		// AKTIFKAN RELAY
//		relayOn(12);
//		// Data TO SCADA
//		dataSeg[12] = 2;		
//		// PESAN KE LCD
//		LCD_Clear();
//		if(strlen(temp13) >= 2){			//check apabila penamaan zone kosong
//			sprintf(buffer1, "ZONE %s AKTIF",temp13);
//			LCD_Putsxy(0,1, buffer1);
//		}else{
//			LCD_Putsxy(0,1, "Segment 13 AKTIF");
//		}
//		DWT_Delayms(1000);
//		sendDataSegment(); 		// SEND TO F1
//	}else{
//		/* MODE AMAN */
//		dataSeg[12] = 0;			
//		sendDataSegment(); 		// SEND TO F1	
//	}
//	if(currentSegment[13] > thresholdSegment[13]){
//		/* FIRE ALARM ACTIVE */
//		// AKTIFKAN RELAY
//		relayOn(13);
//		// Data TO SCADA
//		dataSeg[13] = 2;		
//		// PESAN KE LCD
//		LCD_Clear();
//		if(strlen(temp14) >= 2){			//check apabila penamaan zone kosong
//			sprintf(buffer1, "ZONE %s AKTIF",temp14);
//			LCD_Putsxy(0,1, buffer1);
//		}else{
//			LCD_Putsxy(0,1, "Segment 14 AKTIF");
//		}
//		DWT_Delayms(1000);
//		sendDataSegment(); 		// SEND TO F1
//	}else{
//		/* MODE AMAN */
//		dataSeg[13] = 0;	
//		sendDataSegment(); 		// SEND TO F1
//	}
//	if(currentSegment[14] > thresholdSegment[14]){
//		/* FIRE ALARM ACTIVE */
//		// AKTIFKAN RELAY
//		relayOn(14);
//		// Data TO SCADA
//		dataSeg[14] = 2;		
//		// PESAN KE LCD
//		LCD_Clear();
//		if(strlen(temp15) >= 2){			//check apabila penamaan zone kosong
//			sprintf(buffer1, "ZONE %s AKTIF",temp15);
//			LCD_Putsxy(0,1, buffer1);
//		}else{
//			LCD_Putsxy(0,1, "Segment 15 AKTIF");
//		}
//		DWT_Delayms(1000);
//		sendDataSegment(); 		// SEND TO F1
//	}else{
//		/* MODE AMAN */
//		dataSeg[14] = 0;	
//		sendDataSegment(); 		// SEND TO F1
//	}
//	if(currentSegment[15] > thresholdSegment[15]){
//		/* FIRE ALARM ACTIVE */
//		// AKTIFKAN RELAY
//		relayOn(15);
//		// Data TO SCADA
//		dataSeg[15] = 2;		
//		// PESAN KE LCD
//		LCD_Clear();
//		if(strlen(temp16) >= 2){			//check apabila penamaan zone kosong
//			sprintf(buffer1, "ZONE %s AKTIF",temp16);
//			LCD_Putsxy(0,1, buffer1);
//		}else{
//			LCD_Putsxy(0,1, "Segment 16 AKTIF");
//		}
//		DWT_Delayms(1000);
//		sendDataSegment(); 		// SEND TO F1
//	}else{
//		/* MODE AMAN */
//		dataSeg[15] = 0;	
//		sendDataSegment(); 		// SEND TO F1
//	}
//}
void modeSingleWire(void){
	if(currentSegment[0] > thresholdSegment[0]){
		/* FIRE ALARM ACTIVE */
		LCD_Clear();
		while(1){
			// AKTIFKAN RELAY
			relayOn(0);
			buzzerBlink(250);
			// Data TO SCADA
			dataSeg[0] = 2;
			// PESAN KE LCD
			//LCD_Clear();
			if(strlen(temp1) >= 2){			//check apabila penamaan zone kosong
				sprintf(buffer1,"ZONE %s AKTIF  ",temp1);
				LCD_Putsxy(0,1, buffer1);
			}else{
				LCD_Putsxy(0,1, "Segment 1 AKTIF");
			}
			LCD_Putsxy(0,1, buffer1);
			DWT_Delayms(1000);
			sendDataSegment(); 		// SEND TO F1
			
			if(!buttonPress(BUTTON_RESET_PORT, BUTTON_RESET_PIN,200)){
				buzzerOff(0);
				relayOff(0);
				LCD_Clear();
				break;
			}
		}
	}else{
		/* MODE AMAN */
		dataSeg[0] = 0;		
		sendDataSegment(); 		// SEND TO F1
	}
	if(currentSegment[1] > thresholdSegment[1]){
		/* FIRE ALARM ACTIVE */
		LCD_Clear();
		while(1){
			// AKTIFKAN RELAY
			relayOn(1);
			buzzerBlink(250);
			// Data TO SCADA
			dataSeg[1] = 2;
			// PESAN KE LCD
			//LCD_Clear();
			if(strlen(temp2) >= 2){			//check apabila penamaan zone kosong
				sprintf(buffer1,"ZONE %s AKTIF  ",temp2);
				LCD_Putsxy(0,1, buffer1);
			}else{
				LCD_Putsxy(0,1, "Segment 2 AKTIF");
			}
			LCD_Putsxy(0,1, buffer1);
			DWT_Delayms(1000);
			sendDataSegment(); 		// SEND TO F1
			
			if(!buttonPress(BUTTON_RESET_PORT, BUTTON_RESET_PIN,200)){
				buzzerOff(0);
				relayOff(1);
				LCD_Clear();
				break;
			}
		}
	}else{
		/* MODE AMAN */
		dataSeg[1] = 0;
		sendDataSegment(); 		// SEND TO F1
	}
	if(currentSegment[2] > thresholdSegment[2]){
		/* FIRE ALARM ACTIVE */
		LCD_Clear();
		while(1){
			// AKTIFKAN RELAY
			relayOn(2);
			buzzerBlink(250);
			// Data TO SCADA
			dataSeg[2] = 2;
			// PESAN KE LCD
			//LCD_Clear();
			if(strlen(temp3) >= 2){			//check apabila penamaan zone kosong
				sprintf(buffer1,"ZONE %s AKTIF  ",temp3);
				LCD_Putsxy(0,1, buffer1);
			}else{
				LCD_Putsxy(0,1, "Segment 3 AKTIF");
			}
			LCD_Putsxy(0,1, buffer1);
			DWT_Delayms(1000);
			sendDataSegment(); 		// SEND TO F1
			
			if(!buttonPress(BUTTON_RESET_PORT, BUTTON_RESET_PIN,200)){
				buzzerOff(0);
				relayOff(2);				
				LCD_Clear();
				break;
			}		
		}
	}else{
		/* MODE AMAN */
		dataSeg[2] = 0;		
		sendDataSegment(); 		// SEND TO F1
	}
	if(currentSegment[3] > thresholdSegment[3]){
		/* FIRE ALARM ACTIVE */
		LCD_Clear();
		while(1){
			// AKTIFKAN RELAY
			relayOn(3);
			buzzerBlink(250);
			// Data TO SCADA
			dataSeg[3] = 2;
			// PESAN KE LCD
			//LCD_Clear();
			if(strlen(temp4) >= 2){			//check apabila penamaan zone kosong
				sprintf(buffer1,"ZONE %s AKTIF  ",temp4);
				LCD_Putsxy(0,1, buffer1);
			}else{
				LCD_Putsxy(0,1, "Segment 4 AKTIF");
			}
			LCD_Putsxy(0,1, buffer1);
			DWT_Delayms(1000);
			sendDataSegment(); 		// SEND TO F1
			
			if(!buttonPress(BUTTON_RESET_PORT, BUTTON_RESET_PIN,200)){
				buzzerOff(0);
				relayOff(3);				
				LCD_Clear();
				break;
			}		
		}
	}else{
		/* MODE AMAN */
		dataSeg[3] = 0;		
		sendDataSegment(); 		// SEND TO F1
	}
	if(currentSegment[4] > thresholdSegment[4]){
		/* FIRE ALARM ACTIVE */
		LCD_Clear();
		while(1){
			// AKTIFKAN RELAY
			relayOn(4);
			buzzerBlink(250);
			// Data TO SCADA
			dataSeg[4] = 2;	
			// PESAN KE LCD
			//LCD_Clear();
			if(strlen(temp5) >= 2){			//check apabila penamaan zone kosong
				sprintf(buffer1,"ZONE %s AKTIF  ",temp5);
				LCD_Putsxy(0,1, buffer1);
			}else{
				LCD_Putsxy(0,1, "Segment 5 AKTIF");
			}
			LCD_Putsxy(0,1, buffer1);
			DWT_Delayms(1000);
			sendDataSegment(); 		// SEND TO F1
			
			if(!buttonPress(BUTTON_RESET_PORT, BUTTON_RESET_PIN,200)){
				buzzerOff(0);
				relayOff(4);				
				LCD_Clear();
				break;
			}		
		}
	}else{
		/* MODE AMAN */
		dataSeg[4] = 0;
		sendDataSegment(); 		// SEND TO F1
	}
	if(currentSegment[5] > thresholdSegment[5]){
		/* FIRE ALARM ACTIVE */
		LCD_Clear();
		while(1){
			// AKTIFKAN RELAY
			relayOn(5);
			buzzerBlink(250);
			// Data TO SCADA
			dataSeg[5] = 2;		
			// PESAN KE LCD
			//LCD_Clear();
			if(strlen(temp6) >= 2){			//check apabila penamaan zone kosong
				sprintf(buffer1, "ZONE %s AKTIF  ",temp6);
				LCD_Putsxy(0,1, buffer1);
			}else{
				LCD_Putsxy(0,1, "Segment 6 AKTIF");
			}
			LCD_Putsxy(0,1, buffer1);
			DWT_Delayms(1000);
			sendDataSegment(); 		// SEND TO F1
			
			if(!buttonPress(BUTTON_RESET_PORT, BUTTON_RESET_PIN,200)){
				buzzerOff(0);
				relayOff(5);				
				LCD_Clear();
				break;
			}		
		}
	}else{
		/* MODE AMAN */
		dataSeg[5] = 0;
		sendDataSegment(); 		// SEND TO F1
	}
	if(currentSegment[6] > thresholdSegment[6]){
		/* FIRE ALARM ACTIVE */
		LCD_Clear();
		while(1){
			// AKTIFKAN RELAY
			relayOn(6);
			buzzerBlink(250);
			// Data TO SCADA
			dataSeg[6] = 2;		
			// PESAN KE LCD
			//LCD_Clear();
			if(strlen(temp7) >= 2){			//check apabila penamaan zone kosong
				sprintf(buffer1, "ZONE %s AKTIF  ",temp7);
				LCD_Putsxy(0,1, buffer1);
			}else{
				LCD_Putsxy(0,1, "Segment 7 AKTIF");
			}
			LCD_Putsxy(0,1, buffer1);
			DWT_Delayms(1000);
			sendDataSegment(); 		// SEND TO F1

			if(!buttonPress(BUTTON_RESET_PORT, BUTTON_RESET_PIN,200)){
				buzzerOff(0);
				relayOff(6);				
				LCD_Clear();
				break;
			}			
		}
	}else{
		/* MODE AMAN */
		dataSeg[6] = 0;		
		sendDataSegment(); 		// SEND TO F1
	}
	if(currentSegment[7] > thresholdSegment[7]){
		/* FIRE ALARM ACTIVE */
		LCD_Clear();
		while(1){
			// AKTIFKAN RELAY
			relayOn(7);
			buzzerBlink(250);
			// Data TO SCADA
			dataSeg[7] = 2;		
			// PESAN KE LCD
			//LCD_Clear();
			if(strlen(temp8) >= 2){			//check apabila penamaan zone kosong
				sprintf(buffer1, "ZONE %s AKTIF  ",temp8);
				LCD_Putsxy(0,1, buffer1);
			}else{
				LCD_Putsxy(0,1, "Segment 8 AKTIF");
			}
			LCD_Putsxy(0,1, buffer1);
			DWT_Delayms(1000);
			sendDataSegment(); 		// SEND TO F1
		
			if(!buttonPress(BUTTON_RESET_PORT, BUTTON_RESET_PIN,200)){
				buzzerOff(0);
				relayOff(7);				
				LCD_Clear();
				break;
			}			
		}
	}else{
		/* MODE AMAN */
		dataSeg[7] = 0;	
		sendDataSegment(); 		// SEND TO F1
	}
	if(currentSegment[8] > thresholdSegment[8]){
		/* FIRE ALARM ACTIVE */
		LCD_Clear();
		while(1){
			// AKTIFKAN RELAY
			relayOn(8);
			buzzerBlink(250);
			// USART TO SCADA
			dataSeg[8] = 2;		
			// PESAN KE LCD
			//LCD_Clear();
			if(strlen(temp9) >= 2){			//check apabila penamaan zone kosong
				sprintf(buffer1, "ZONE %s AKTIF  ",temp9);
				LCD_Putsxy(0,1, buffer1);
			}else{
				LCD_Putsxy(0,1, "Segment 9 AKTIF");
			}
			LCD_Putsxy(0,1, buffer1);
			DWT_Delayms(1000);
			sendDataSegment(); 		// SEND TO F1

			if(!buttonPress(BUTTON_RESET_PORT, BUTTON_RESET_PIN,200)){
				buzzerOff(0);
				relayOff(8);				
				LCD_Clear();
				break;
			}			
		}
	}else{
		/* MODE AMAN */
		dataSeg[8] = 0;	
		sendDataSegment(); 		// SEND TO F1
	}
	if(currentSegment[9] > thresholdSegment[9]){
		/* FIRE ALARM ACTIVE */
		LCD_Clear();
		while(1){
			// AKTIFKAN RELAY
			relayOn(9);
			buzzerBlink(250);
			// Data TO SCADA
			dataSeg[9] = 2;		
			// PESAN KE LCD
			//LCD_Clear();
			if(strlen(temp10) >= 2){			//check apabila penamaan zone kosong
				sprintf(buffer1, "ZONE %s AKTIF   ",temp10);
				LCD_Putsxy(0,1, buffer1);
			}else{
				LCD_Putsxy(0,1, "Segment 10 AKTIF");
			}
			LCD_Putsxy(0,1, buffer1);
			DWT_Delayms(1000);
			sendDataSegment(); 		// SEND TO F1

			if(!buttonPress(BUTTON_RESET_PORT, BUTTON_RESET_PIN,200)){
				buzzerOff(0);
				relayOff(9);				
				LCD_Clear();
				break;
			}
		}
	}else{
		/* MODE AMAN */
		dataSeg[9] = 0;		
		sendDataSegment(); 		// SEND TO F1
	}
	if(currentSegment[10] > thresholdSegment[10]){
		/* FIRE ALARM ACTIVE */
		LCD_Clear();
		while(1){
			// AKTIFKAN RELAY
			relayOn(10);
			buzzerBlink(250);
			// Data TO SCADA
			dataSeg[9] = 2;		
			// PESAN KE LCD
			//LCD_Clear();
			if(strlen(temp11) >= 2){			//check apabila penamaan zone kosong
				sprintf(buffer1, "ZONE %s AKTIF   ",temp11);
				LCD_Putsxy(0,1, buffer1);
			}else{
				LCD_Putsxy(0,1, "Segment 11 AKTIF");
			}
			DWT_Delayms(1000);
			sendDataSegment(); 		// SEND TO F1
		
			if(!buttonPress(BUTTON_RESET_PORT, BUTTON_RESET_PIN,200)){
				buzzerOff(0);
				relayOff(10);				
				LCD_Clear();
				break;
			}		
		}
	}else{
		/* MODE AMAN */
		dataSeg[10] = 0;		
		sendDataSegment(); 		// SEND TO F1		
	}
	if(currentSegment[11] > thresholdSegment[11]){
		/* FIRE ALARM ACTIVE */
		LCD_Clear();
		while(1){
			// AKTIFKAN RELAY
			relayOn(11);
			buzzerBlink(250);
			// Data TO SCADA
			dataSeg[11] = 2;		
			// PESAN KE LCD
			//LCD_Clear();
			if(strlen(temp12) >= 2){			//check apabila penamaan zone kosong
				sprintf(buffer1, "ZONE %s AKTIF   ",temp12);
				LCD_Putsxy(0,1, buffer1);
			}else{
				LCD_Putsxy(0,1, "Segment 12 AKTIF");
			}
			DWT_Delayms(1000);
			sendDataSegment(); 		// SEND TO F1

			if(!buttonPress(BUTTON_RESET_PORT, BUTTON_RESET_PIN,200)){
				buzzerOff(0);
				relayOff(11);				
				LCD_Clear();
				break;
			}			
		}
	}else{
		/* MODE AMAN */
		dataSeg[11] = 0;			
		sendDataSegment(); 		// SEND TO F1
	}
	if(currentSegment[12] > thresholdSegment[12]){
		/* FIRE ALARM ACTIVE */
		LCD_Clear();
		while(1){
			// AKTIFKAN RELAY
			relayOn(12);
			buzzerBlink(250);
			// Data TO SCADA
			dataSeg[12] = 2;		
			// PESAN KE LCD
			//LCD_Clear();
			if(strlen(temp13) >= 2){			//check apabila penamaan zone kosong
				sprintf(buffer1, "ZONE %s AKTIF   ",temp13);
				LCD_Putsxy(0,1, buffer1);
			}else{
				LCD_Putsxy(0,1, "Segment 13 AKTIF");
			}
			DWT_Delayms(1000);
			sendDataSegment(); 		// SEND TO F1
		
			if(!buttonPress(BUTTON_RESET_PORT, BUTTON_RESET_PIN,200)){
				buzzerOff(0);
				relayOff(12);				
				LCD_Clear();
				break;
			}			
		}
	}else{
		/* MODE AMAN */
		dataSeg[12] = 0;			
		sendDataSegment(); 		// SEND TO F1	
	}
	if(currentSegment[13] > thresholdSegment[13]){
		/* FIRE ALARM ACTIVE */
		LCD_Clear();
		while(1){
			// AKTIFKAN RELAY
			relayOn(13);
			buzzerBlink(250);
			// Data TO SCADA
			dataSeg[13] = 2;		
			// PESAN KE LCD
			//LCD_Clear();
			if(strlen(temp14) >= 2){			//check apabila penamaan zone kosong
				sprintf(buffer1, "ZONE %s AKTIF   ",temp14);
				LCD_Putsxy(0,1, buffer1);
			}else{
				LCD_Putsxy(0,1, "Segment 14 AKTIF");
			}
			DWT_Delayms(1000);
			sendDataSegment(); 		// SEND TO F1

			if(!buttonPress(BUTTON_RESET_PORT, BUTTON_RESET_PIN,200)){
				buzzerOff(0);
				relayOff(13);				
				LCD_Clear();
				break;
			}			
		}
	}else{
		/* MODE AMAN */
		dataSeg[13] = 0;	
		sendDataSegment(); 		// SEND TO F1
	}
	if(currentSegment[14] > thresholdSegment[14]){
		/* FIRE ALARM ACTIVE */
		LCD_Clear();
		while(1){
			// AKTIFKAN RELAY
			relayOn(14);
			buzzerBlink(250);
			// Data TO SCADA
			dataSeg[14] = 2;		
			// PESAN KE LCD
			//LCD_Clear();
			if(strlen(temp15) >= 2){			//check apabila penamaan zone kosong
				sprintf(buffer1, "ZONE %s AKTIF   ",temp15);
				LCD_Putsxy(0,1, buffer1);
			}else{
				LCD_Putsxy(0,1, "Segment 15 AKTIF");
			}
			DWT_Delayms(1000);
			sendDataSegment(); 		// SEND TO F1
		
