rizkyzullfhamy/FireAlarm_Mutant_STM32F4/MDK-ARM/SENSOR.c
			if(!buttonPress(BUTTON_RESET_PORT, BUTTON_RESET_PIN,200)){
				buzzerOff(0);
				relayOff(14);				
				LCD_Clear();
				break;
			}			
		}
	}else{
		/* MODE AMAN */
		dataSeg[14] = 0;	
		sendDataSegment(); 		// SEND TO F1
	}
	if(currentSegment[15] > thresholdSegment[15]){
		/* FIRE ALARM ACTIVE */
		LCD_Clear();
		while(1){
			// AKTIFKAN RELAY
			relayOn(15);
			buzzerBlink(250);
			// Data TO SCADA
			dataSeg[15] = 2;		
			// PESAN KE LCD
			//LCD_Clear();
			if(strlen(temp16) >= 2){			//check apabila penamaan zone kosong
				sprintf(buffer1, "ZONE %s AKTIF   ",temp16);
				LCD_Putsxy(0,1, buffer1);
			}else{
				LCD_Putsxy(0,1, "Segment 16 AKTIF");
			}
			DWT_Delayms(1000);
			sendDataSegment(); 		// SEND TO F1
		
			if(!buttonPress(BUTTON_RESET_PORT, BUTTON_RESET_PIN,200)){
				buzzerOff(0);
				relayOff(15);
				LCD_Clear();
				break;
			}			
		}
	}else{
		/* MODE AMAN */
		dataSeg[15] = 0;	
		sendDataSegment(); 		// SEND TO F1
	}
}
void modeCrossWire(void){
	/* ==================SEGMENT 1 DAN 2==================*/
	if(currentSegment[0] > thresholdSegment[0]){		/* PRE ALARM */
			// PESAN KE LCD
		LCD_Clear();
		//LCD_Putsxy(14,0, "MUTANT 2.0");
		while(1){
			// BUZZERR BLINK
			//LCD_Putsxy(14,0, "MUTANT 2.0");
			// DATA TO SCADA
			dataSeg[0] = 1;
			if(strlen(temp1) >= 2){			//check apabila penamaan zone kosong
				sprintf(buffer1, "ZONE %s AKTIF   ",temp1);
				LCD_Putsxy(0,1, buffer1);
			}else{
				LCD_Putsxy(0,1, "Segment 1 AKTIF");
			}
			//LCD_Clear();
			buzzerBlink(1000);
			sendDataSegment(); 		// SEND TO F1
			
			if(!buttonPress(BUTTON_RESET_PORT, BUTTON_RESET_PIN, 250)){
				LCD_Clear();
				buzzerOff(0);
				break;
			}
			
			if((currentSegment[1] > thresholdSegment[1])){
				LCD_Clear();
				buzzerOff(0);
				goto sensor1_2;
			}
		}
		//if((currentSegment[0] > thresholdSegment[0]) && (currentSegment[1] > thresholdSegment[1])){
		sensor1_2:	
			/* FIRE ALARM ACTIVE */
		LCD_Clear();
		//LCD_Putsxy(14,0, "MUTANT 2.0");
		while(1){
			// AKTIFKAN RELAY 0
			//LCD_Putsxy(14,0, "MUTANT 2.0");
				relayOn(0);
				relayOn(1);
			// DATA TO SCADA
				 dataSeg[0] = 2;
				 dataSeg[1] = 2;
			// PESAN KE LCD
				if(strlen(temp1) >= 2 && strlen(temp2) >= 2){			//check apabila penamaan zone kosong
					sprintf(buffer1, "ZONE %s & %s AKTIF",temp1, temp2);
					LCD_Putsxy(0,1, buffer1);
				}else{
					LCD_Putsxy(0,1, "Segment 1 & 2 AKTIF");
				}
				buzzerBlink(1000);
				sendDataSegment(); 		// SEND TO F1
				
				if(!buttonPress(BUTTON_RESET_PORT, BUTTON_RESET_PIN, 250)){
					LCD_Clear();
					relayOff(0);
					relayOff(1);
					buzzerOff(0);
					break;
					break;
				}
			}	
	}
	else if(currentSegment[1] > thresholdSegment[1]){
			/* PRE ALARM */
			// PESAN KE LCD
		LCD_Clear();
		LCD_Putsxy(14,0, "MUTANT 2.0");
		while(1){
			if(strlen(temp2) >= 2){			//check apabila penamaan zone kosong
				sprintf(buffer1, "ZONE %s AKTIF",temp2);
				LCD_Putsxy(0,1, buffer1);
			}else{
				LCD_Putsxy(0,1, "Segment 2 AKTIF");
			}
			// DATA TO SCADA
			dataSeg[1] = 1;
			// BUZZERR BLINK
			buzzerBlink(1000);
			//LCD_Clear();
			sendDataSegment(); 		// SEND TO F1
			if(!buttonPress(BUTTON_RESET_PORT, BUTTON_RESET_PIN, 250)){
				LCD_Clear();
				buzzerOff(0);
				break;
			}
			
			if((currentSegment[0] > thresholdSegment[0])){
				LCD_Clear();
				buzzerOff(0);
				goto sensor2_1;
			}
		}
		sensor2_1:
		//if((currentSegment[0] > thresholdSegment[0]) && (currentSegment[1] > thresholdSegment[1])){
		LCD_Clear();
		//LCD_Putsxy(14,0, "MUTANT 2.0");
		while(1){
			//LCD_Putsxy(14,0, "MUTANT 2.0");
			/* FIRE ALARM ACTIVE */
			// AKTIFKAN RELAY 0
				relayOn(0);
				relayOn(1);
			// DATA TO SCADA
				 dataSeg[0] = 2;
				 dataSeg[1] = 2;
			// PESAN KE LCD
				if(strlen(temp1) >= 2 && strlen(temp2) >= 2){			//check apabila penamaan zone kosong
					sprintf(buffer1, "ZONE %s & %s AKTIF",temp1, temp2);
					LCD_Putsxy(0,1, buffer1);
				}else{
					LCD_Putsxy(0,1, "Segment 1 & 2 AKTIF");
				}
				buzzerBlink(1000);
				sendDataSegment(); 		// SEND TO F1
				
				if(!buttonPress(BUTTON_RESET_PORT, BUTTON_RESET_PIN, 250)){
					LCD_Clear();
					relayOff(0);
					relayOff(1);
					buzzerOff(0);
					break;
					break;
				}
			}
	}else if(currentSegment[0] > openShortCircuit[0] && currentSegment[0] < thresholdSegment[0]){
				/* KONDISI AMAN SEGMENT 1*/
				// DATA TO SCADA
				 dataSeg[0] = 0;
				sendDataSegment(); 		// SEND TO F1
				if(currentSegment[1] > openShortCircuit[1] && currentSegment[1] < thresholdSegment[1]){
					/* KONDISI AMAN SEGMENT 1*/
				  // DATA TO SCADA
				  dataSeg[1] = 0;
					sendDataSegment(); 		// SEND TO F1
				}
	}else if(currentSegment[1] > openShortCircuit[1] && currentSegment[1] < thresholdSegment[1]){
				/* KONDISI AMAN SEGMENT 2*/
				// DATA TO SCADA
				dataSeg[1] = 0;
				sendDataSegment(); 		// SEND TO F1		
				if(currentSegment[0] > openShortCircuit[0] && currentSegment[0] < thresholdSegment[0]){
					/* KONDISI AMAN SEGMENT 1*/
				  // DATA TO SCADA
				  dataSeg[0] = 0;
					sendDataSegment(); 		// SEND TO F1
				}
			}
		/* ===============SEGMENT 3 DAN 4===================== */
		if(currentSegment[2] > thresholdSegment[2]){
			/* PRE ALARM */
			// PESAN KE LCD
			LCD_Clear();
			while(1){
				if(strlen(temp3) >= 2){			//check apabila penamaan zone kosong
					sprintf(buffer1, "ZONE %s AKTIF",temp3);
					LCD_Putsxy(0,1, buffer1);
				}else{
					LCD_Putsxy(0,1, "Segment 3 AKTIF");
				}
				// DATA TO SCADA
				dataSeg[2] = 1;
				// BUZZERR BLINK
				buzzerBlink(1000);
				//LCD_Clear();
				sendDataSegment(); 		// SEND TO F1
				if(!buttonPress(BUTTON_RESET_PORT, BUTTON_RESET_PIN, 250)){
					LCD_Clear();
					buzzerOff(0);
					break;
				}
				
				if((currentSegment[3] > thresholdSegment[3])){
					LCD_Clear();
					buzzerOff(0);
					goto sensor3_4;
				}
			}
		//if((currentSegment[2] > thresholdSegment[2]) && (currentSegment[3] > thresholdSegment[3])){
			sensor3_4:
			LCD_Clear();
			while(1){
			/* FIRE ALARM ACTIVE */
			// AKTIFKAN RELAY 0
				relayOn(2);
				relayOn(3);
			// DATA TO SCADA
				 dataSeg[2] = 2;
				 dataSeg[3] = 2;
			// PESAN KE LCD
				if(strlen(temp3) >= 2 && strlen(temp4) >= 2){			//check apabila penamaan zone kosong
					sprintf(buffer1, "ZONE %s & %s AKTIF",temp3, temp4);
					LCD_Putsxy(0,1, buffer1);
				}else{
					LCD_Putsxy(0,1, "Segment 3 & 4 AKTIF");
				}
				buzzerBlink(1000);
				sendDataSegment(); 		// SEND TO F1

				if(!buttonPress(BUTTON_RESET_PORT, BUTTON_RESET_PIN, 250)){
					LCD_Clear();
					relayOff(2);
					relayOff(3);
					buzzerOff(0);
					break;
					break;
				}
			}
		}	
		else if(currentSegment[3] > thresholdSegment[3]){
			/* PRE ALARM */
			// PESAN KE LCD
				LCD_Clear();
			while(1){
				if(strlen(temp4) >= 2){			//check apabila penamaan zone kosong
					sprintf(buffer1, "ZONE %s AKTIF",temp4);
					LCD_Putsxy(0,1, buffer1);
				}else{
					LCD_Putsxy(0,1, "Segment 4 AKTIF");
				}
				// DATA TO SCADA
				dataSeg[3] = 1;
				// BUZZERR BLINK
				buzzerBlink(1000);
				sendDataSegment(); 		// SEND TO F1
				if(!buttonPress(BUTTON_RESET_PORT, BUTTON_RESET_PIN, 250)){
					LCD_Clear();
					buzzerOff(0);
					break;
				}
				
