rizkyzullfhamy/FireAlarm_Mutant_STM32F4/MDK-ARM/SENSOR.c
				if((currentSegment[2] > thresholdSegment[2])){
					LCD_Clear();
					buzzerOff(0);
					goto sensor4_3;
				}
			}
		//if((currentSegment[2] > thresholdSegment[2]) && (currentSegment[3] > thresholdSegment[3])){
			sensor4_3:
			LCD_Clear();
			/* FIRE ALARM ACTIVE */
			while(1){
			// AKTIFKAN RELAY 0
				relayOn(2);
				relayOn(3);
			// DATA TO SCADA
				 dataSeg[2] = 2;
				 dataSeg[3] = 2;		
			// PESAN KE LCD
				if(strlen(temp3) >= 2 && strlen(temp4) >= 2){			//check apabila penamaan zone kosong
					sprintf(buffer1, "ZONE %s & %s AKTIF",temp3, temp4);
					LCD_Putsxy(0,1, buffer1);
				}else{
					LCD_Putsxy(0,1, "Segment 3 & 4 AKTIF");
				}
				buzzerBlink(1000);
				sendDataSegment(); 		// SEND TO F1		
				
				if(!buttonPress(BUTTON_RESET_PORT, BUTTON_RESET_PIN, 250)){
					LCD_Clear();
					relayOff(2);
					relayOff(3);
					buzzerOff(0);
					break;
					break;
				}
			}
	}else if(currentSegment[2] > openShortCircuit[2] && currentSegment[2] < thresholdSegment[2]){
				/* KONDISI AMAN SEGMENT 1*/
				// DATA TO SCADA
				 dataSeg[2] = 0;
				sendDataSegment(); 		// SEND TO F1
				if(currentSegment[3] > openShortCircuit[3] && currentSegment[3] < thresholdSegment[3]){
					/* KONDISI AMAN SEGMENT 1*/
				  // DATA TO SCADA
				  dataSeg[3] = 0;
				  sendDataSegment(); 		// SEND TO F1
				}
	}else if(currentSegment[3] > openShortCircuit[3] && currentSegment[3] < thresholdSegment[3]){
				/* KONDISI AMAN SEGMENT 2*/
				// DATA TO SCADA
				 dataSeg[3] = 0;		
				 sendDataSegment(); 		// SEND TO F1
				if(currentSegment[2] > openShortCircuit[2] && currentSegment[2] < thresholdSegment[2]){
					/* KONDISI AMAN SEGMENT 1*/
				  // DATA TO SCADA
				  dataSeg[2] = 0;
				  sendDataSegment(); 		// SEND TO F1
				}	
	}
	/* ===============SEGMENT 5 DAN 6===================== */
		if(currentSegment[4] > thresholdSegment[4]){
			/* PRE ALARM */
			// PESAN KE LCD
			LCD_Clear();	
			while(1){
			if(strlen(temp5) >= 2){			//check apabila penamaan zone kosong
				sprintf(buffer1, "ZONE %s AKTIF",temp5);
				LCD_Putsxy(0,1, buffer1);
			}else{
				LCD_Putsxy(0,1, "Segment 5 AKTIF");
			}
			// DATA TO SCADA
			dataSeg[4] = 1;
			// BUZZERR BLINK
			buzzerBlink(1000);
			sendDataSegment(); 		// SEND TO F1
			if(!buttonPress(BUTTON_RESET_PORT, BUTTON_RESET_PIN, 250)){
				LCD_Clear();
				buzzerOff(0);
				break;
			}
			
			if((currentSegment[5] > thresholdSegment[5])){
				LCD_Clear();
				buzzerOff(0);
				goto sensor5_6;
			}
		}
		//if((currentSegment[4] > thresholdSegment[4]) && (currentSegment[5] > thresholdSegment[5])){
		sensor5_6:	
			/* FIRE ALARM ACTIVE */
		LCD_Clear();
		while(1){
			// AKTIFKAN RELAY 0
				relayOn(4);
				relayOn(5);
			// DATA TO SCADA
				 dataSeg[4] = 2;
				 dataSeg[5] = 2;	
			// PESAN KE LCD
				if(strlen(temp5) >= 2 && strlen(temp6) >= 2){			//check apabila penamaan zone kosong
					sprintf(buffer1, "ZONE %s & %s AKTIF",temp5, temp6);
					LCD_Putsxy(0,1, buffer1);
				}else{
					LCD_Putsxy(0,1, "Segment 5 & 6 AKTIF");
				}
				buzzerBlink(1000);
				sendDataSegment(); 		// SEND TO F1
				
				if(!buttonPress(BUTTON_RESET_PORT, BUTTON_RESET_PIN, 250)){
					LCD_Clear();
					relayOff(4);
					relayOff(5);
					buzzerOff(0);
					break;
					break;
				}
			}				
	}
		else if(currentSegment[5] > thresholdSegment[5]){
			/* PRE ALARM */
			// PESAN KE LCD
			LCD_Clear();
			while(1){
			if(strlen(temp6) >= 2){			//check apabila penamaan zone kosong
				sprintf(buffer1, "ZONE %s AKTIF",temp6);
				LCD_Putsxy(0,1, buffer1);
			}else{
				LCD_Putsxy(0,1, "Segment 6 AKTIF");
			}
			// DATA TO SCADA
			dataSeg[5] = 1;
			// BUZZERR BLINK
			buzzerBlink(1000);
			sendDataSegment(); 		// SEND TO F1
			if(!buttonPress(BUTTON_RESET_PORT, BUTTON_RESET_PIN, 250)){
				LCD_Clear();
				buzzerOff(0);
				break;
			}
			
			if((currentSegment[4] > thresholdSegment[4])){
				LCD_Clear();
				buzzerOff(0);
				goto sensor6_5;
			}
		}
		//if((currentSegment[4] > thresholdSegment[4]) && (currentSegment[5] > thresholdSegment[5])){
		sensor6_5:
			LCD_Clear();
		/* FIRE ALARM ACTIVE */
			while(1){
		// AKTIFKAN RELAY 0
				relayOn(4);
				relayOn(5);
			// DATA TO SCADA
				 dataSeg[4] = 2;
				 dataSeg[5] = 2;	
			// PESAN KE LCD
				if(strlen(temp5) >= 2 && strlen(temp6) >= 2){			//check apabila penamaan zone kosong
					sprintf(buffer1, "ZONE %s & %s AKTIF",temp5, temp6);
					LCD_Putsxy(0,1, buffer1);
				}else{
					LCD_Putsxy(0,1, "Segment 5 & 6 AKTIF");
				}
				buzzerBlink(1000);
				sendDataSegment(); 		// SEND TO F1
				
				if(!buttonPress(BUTTON_RESET_PORT, BUTTON_RESET_PIN, 250)){
					LCD_Clear();
					relayOff(4);
					relayOff(5);
					buzzerOff(0);
					break;
					break;
				}
			}
	}else if(currentSegment[4] > openShortCircuit[4] && currentSegment[4] < thresholdSegment[4]){
				/* KONDISI AMAN SEGMENT 1*/
				//LCD_Clear();
				// DATA TO SCADA
				 dataSeg[4] = 0;
				sendDataSegment(); 		// SEND TO F1
				if(currentSegment[5] > openShortCircuit[5] && currentSegment[5] < thresholdSegment[5]){
					/* KONDISI AMAN SEGMENT 1*/
					//LCD_Clear();
				  // DATA TO SCADA
				  dataSeg[5] = 0;
				  sendDataSegment(); 		// SEND TO F1
				}
	}else if(currentSegment[5] > openShortCircuit[5] && currentSegment[5] < thresholdSegment[5]){
				/* KONDISI AMAN SEGMENT 2*/
				//LCD_Clear();
				// DATA TO SCADA
				dataSeg[5] = 0;
				sendDataSegment(); 		// SEND TO F1		
				if(currentSegment[4] > openShortCircuit[4] && currentSegment[4] < thresholdSegment[4]){
					/* KONDISI AMAN SEGMENT 1*/
					//LCD_Clear();
				  // DATA TO SCADA
				  dataSeg[4] = 0;
				  sendDataSegment(); 		// SEND TO F1
				}	
	}
	
	/* ===============SEGMENT 7 DAN 8===================== */
		if(currentSegment[6] > thresholdSegment[6]){
			LCD_Clear();
			/* PRE ALARM */
			while(1){
			// PESAN KE LCD
			if(strlen(temp7) >= 2){			//check apabila penamaan zone kosong
				sprintf(buffer1, "ZONE %s AKTIF",temp7);
				LCD_Putsxy(0,1, buffer1);
			}else{
				LCD_Putsxy(0,1, "Segment 7 AKTIF");
			}
			// DATA TO SCADA
			dataSeg[6] = 2;
			// BUZZERR BLINK
			buzzerBlink(2000);
			sendDataSegment(); 		// SEND TO F1
			if(!buttonPress(BUTTON_RESET_PORT, BUTTON_RESET_PIN, 250)){
				LCD_Clear();
				buzzerOff(0);
				break;
			}
			
