rizkyzullfhamy/FireAlarm_Mutant_STM32F4/MDK-ARM/SENSOR.c
			if((currentSegment[7] > thresholdSegment[7])){
				LCD_Clear();
				buzzerOff(0);
				goto sensor7_8;
			}
		}
		//if((currentSegment[6] > thresholdSegment[6]) && (currentSegment[7] > thresholdSegment[7])){
		sensor7_8:
			LCD_Clear();
		/* FIRE ALARM ACTIVE */
			while(1){
			// AKTIFKAN RELAY 0
				relayOn(6);
				relayOn(7);
			// DATA TO SCADA
				 dataSeg[6] = 2;
				 dataSeg[7] = 2;	
			// PESAN KE LCD
				if(strlen(temp8) >= 2 && strlen(temp7) >= 2){			//check apabila penamaan zone kosong
					sprintf(buffer1, "ZONE %s & %s AKTIF",temp7, temp8);
					LCD_Putsxy(0,1, buffer1);
				}else{
					LCD_Putsxy(0,1, "Segment 7 & 8 AKTIF");
				}
				buzzerBlink(1000);
				sendDataSegment(); 		// SEND TO F1
				
				if(!buttonPress(BUTTON_RESET_PORT, BUTTON_RESET_PIN, 250)){
					LCD_Clear();
					relayOff(6);
					relayOff(7);
					buzzerOff(0);
					break;
					break;
				}
			}
		}
		else if(currentSegment[7] > thresholdSegment[7]){
			/* PRE ALARM */
			LCD_Clear();
			// PESAN KE LCD
			while(1){
			if(strlen(temp8) >= 2){			//check apabila penamaan zone kosong
				sprintf(buffer1, "ZONE %s AKTIF",temp8);
				LCD_Putsxy(0,1, buffer1);
			}else{
				LCD_Putsxy(0,1, "Segment 8 AKTIF");
			}
			// DATA TO SCADA
			dataSeg[7] = 2;
			// BUZZERR BLINK
			buzzerBlink(1000);
			sendDataSegment(); 		// SEND TO F1
			if(!buttonPress(BUTTON_RESET_PORT, BUTTON_RESET_PIN, 250)){
				LCD_Clear();
				buzzerOff(0);
				break;
			}
			
			if((currentSegment[6] > thresholdSegment[6])){
				LCD_Clear();
				buzzerOff(0);
				goto sensor8_7;
			}
		}
		//if((currentSegment[6] > thresholdSegment[6]) && (currentSegment[7] > thresholdSegment[7])){
		sensor8_7:
			LCD_Clear();
			/* FIRE ALARM ACTIVE */
			while(1){
			// AKTIFKAN RELAY 0
				relayOn(6);
				relayOn(7);
			// DATA TO SCADA
				 dataSeg[6] = 2;
				 dataSeg[7] = 2;	
			// PESAN KE LCD
				if(strlen(temp8) >= 2 && strlen(temp7) >= 2){			//check apabila penamaan zone kosong
					sprintf(buffer1, "ZONE %s & %s AKTIF",temp7, temp8);
					LCD_Putsxy(0,1, buffer1);
				}else{
					LCD_Putsxy(0,1, "Segment 7 & 8 AKTIF");
				}
				buzzerBlink(1000);
				sendDataSegment(); 		// SEND TO F1			
			if(!buttonPress(BUTTON_RESET_PORT, BUTTON_RESET_PIN, 250)){
					LCD_Clear();
					relayOff(6);
					relayOff(7);
					buzzerOff(0);
					break;
					break;
				}
			}
	}else if(currentSegment[6] > openShortCircuit[6] && currentSegment[6] < thresholdSegment[6]){
				/* KONDISI AMAN SEGMENT 1*/
				//LCD_Clear();
				// DATA TO SCADA
				 dataSeg[6] = 0;
				sendDataSegment(); 		// SEND TO F1
				if(currentSegment[7] > openShortCircuit[7] && currentSegment[7] < thresholdSegment[7]){
					/* KONDISI AMAN SEGMENT 1*/
					//LCD_Clear();
				  // DATA TO SCADA
				  dataSeg[7] = 0;
					sendDataSegment(); 		// SEND TO F1
				}
	}else if(currentSegment[7] > openShortCircuit[7] && currentSegment[7] < thresholdSegment[7]){
				/* KONDISI AMAN SEGMENT 2*/
				//LCD_Clear();
				// DATA TO SCADA
				 dataSeg[7] = 0;		
				if(currentSegment[6] > openShortCircuit[6] && currentSegment[6] < thresholdSegment[6]){
					/* KONDISI AMAN SEGMENT 1*/
					//LCD_Clear();
				  // DATA TO SCADA
				  dataSeg[6] = 0;
					sendDataSegment(); 		// SEND TO F1
				}	
	}
	
	/* ===============SEGMENT 9 DAN 10===================== */
		if(currentSegment[8] > thresholdSegment[8]){
			/* PRE ALARM */
			// PESAN KE LCD
			LCD_Clear();
			while(1){			
			if(strlen(temp9) >= 2){			//check apabila penamaan zone kosong
				sprintf(buffer1, "ZONE %s AKTIF",temp9);
				LCD_Putsxy(0,1, buffer1);
			}else{
				LCD_Putsxy(0,1, "Segment 9 AKTIF");
			}
			// DATA TO SCADA
			dataSeg[8] = 2;
			// BUZZERR BLINK
			buzzerBlink(1000);		
			sendDataSegment(); 		// SEND TO F1
			if(!buttonPress(BUTTON_RESET_PORT, BUTTON_RESET_PIN, 250)){
				LCD_Clear();
				buzzerOff(0);
				break;
			}
			
			if((currentSegment[9] > thresholdSegment[9])){
				LCD_Clear();
				buzzerOff(0);
				goto sensor9_10;
			}
		}
		//if((currentSegment[8] > thresholdSegment[8]) && (currentSegment[9] > thresholdSegment[9])){
		sensor9_10:
		LCD_Clear();
		/* FIRE ALARM ACTIVE */
		while(1){
			// AKTIFKAN RELAY 0
				relayOn(8);
				relayOn(9);
			// DATA TO SCADA
				 dataSeg[8] = 2;
				 dataSeg[9] = 2;	
			// PESAN KE LCD
				if(strlen(temp9) >= 2 && strlen(temp10) >= 2){			//check apabila penamaan zone kosong
					sprintf(buffer1, "ZONE %s & %s AKTIF",temp9, temp10);
					LCD_Putsxy(0,1, buffer1);
				}else{
					LCD_Putsxy(0,1, "Segment 9 & 10 AKTIF");
				}	
				buzzerBlink(1000);
				sendDataSegment(); 		// SEND TO F1
				
				if(!buttonPress(BUTTON_RESET_PORT, BUTTON_RESET_PIN, 250)){
					LCD_Clear();
					relayOff(8);
					relayOff(9);
					buzzerOff(0);
					break;
					break;
				}
			}
		}
		else if(currentSegment[9] > thresholdSegment[9]){
			/* PRE ALARM */
			// PESAN KE LCD
			LCD_Clear();
			while(1){
			if(strlen(temp10) >= 2){			//check apabila penamaan zone kosong
				sprintf(buffer1, "ZONE %s AKTIF",temp10);
				LCD_Putsxy(0,1, buffer1);
			}else{
				LCD_Putsxy(0,1, "Segment 10 AKTIF");
			}		
			// DATA TO SCADA
			dataSeg[9] = 2;		
			// BUZZERR BLINK
			buzzerBlink(1000);
			sendDataSegment(); 		// SEND TO F1
			if(!buttonPress(BUTTON_RESET_PORT, BUTTON_RESET_PIN, 250)){
				LCD_Clear();
				buzzerOff(0);
				break;
			}
			
			if((currentSegment[8] > thresholdSegment[8])){
				LCD_Clear();
				buzzerOff(0);
				goto sensor10_9;
			}
		}			
		//if((currentSegment[8] > thresholdSegment[8]) && (currentSegment[9] > thresholdSegment[9])){
		sensor10_9:
			LCD_Clear();
		/* FIRE ALARM ACTIVE */
		while(1){
			// AKTIFKAN RELAY 0
				relayOn(8);
				relayOn(9);
			// DATA TO SCADA
				 dataSeg[8] = 2;
				 dataSeg[9] = 2;	
			// PESAN KE LCD
				if(strlen(temp9) >= 2 && strlen(temp10) >= 2){			//check apabila penamaan zone kosong
					sprintf(buffer1, "ZONE %s & %s AKTIF",temp9, temp10);
					LCD_Putsxy(0,1, buffer1);
				}else{
					LCD_Putsxy(0,1, "Segment 9 & 10 AKTIF");
				}	
				buzzerBlink(1000);
				sendDataSegment(); 		// SEND TO F1
				if(!buttonPress(BUTTON_RESET_PORT, BUTTON_RESET_PIN, 250)){
					LCD_Clear();
					relayOff(8);
					relayOff(9);
					buzzerOff(0);
					break;
					break;
				}
			}
	}else if(currentSegment[8] > openShortCircuit[8] && currentSegment[8] < thresholdSegment[8]){
				/* KONDISI AMAN SEGMENT 1*/
				//LCD_Clear();
				// DATA TO SCADA
				 dataSeg[8] = 0;
				sendDataSegment(); 		// SEND TO F1
				if(currentSegment[9] > openShortCircuit[9] && currentSegment[9] < thresholdSegment[9]){
					/* KONDISI AMAN SEGMENT 1*/
					//LCD_Clear();
				  // DATA TO SCADA
				  dataSeg[9] = 0;
					sendDataSegment(); 		// SEND TO F1
				}
	}else if(currentSegment[9] > openShortCircuit[9] && currentSegment[9] < thresholdSegment[9]){
				/* KONDISI AMAN SEGMENT 2*/
				//LCD_Clear();
				// DATA TO SCADA
				dataSeg[9] = 0;
				sendDataSegment(); 		// SEND TO F1		
				if(currentSegment[8] > openShortCircuit[8] && currentSegment[8] < thresholdSegment[8]){
					/* KONDISI AMAN SEGMENT 1*/
					//LCD_Clear();
				  // DATA TO SCADA
				  dataSeg[8] = 0;
					sendDataSegment(); 		// SEND TO F1
				}	
	}
	
	/* ===============SEGMENT 11 DAN 12===================== */
		if(currentSegment[10] > thresholdSegment[10]){
			LCD_Clear();
			/* PRE ALARM */
			while(1){
			// PESAN KE LCD
			if(strlen(temp11) >= 2){			//check apabila penamaan zone kosong
				sprintf(buffer1, "ZONE %s AKTIF",temp11);
				LCD_Putsxy(0,1, buffer1);
			}else{
				LCD_Putsxy(0,1, "Segment 11 AKTIF");
			}		
			// DATA TO SCADA
				 dataSeg[10] = 2;
			// BUZZERR BLINK
			buzzerBlink(1000);
			sendDataSegment(); 		// SEND TO F1
			if(!buttonPress(BUTTON_RESET_PORT, BUTTON_RESET_PIN, 250)){
				LCD_Clear();
				buzzerOff(0);
				break;
			}
			
			if((currentSegment[11] > thresholdSegment[11])){
				LCD_Clear();
				buzzerOff(0);
				goto sensor11_12;
			}		
		}
		//if((currentSegment[10] > thresholdSegment[10]) && (currentSegment[11] > thresholdSegment[11])){
		sensor11_12:	
			LCD_Clear();
		/* FIRE ALARM ACTIVE */
			while(1){
			// AKTIFKAN RELAY 0
				relayOn(10);
				relayOn(11);
			// DATA TO SCADA
				 dataSeg[10] = 2;
				 dataSeg[11] = 2;	
			// PESAN KE LCD
				if(strlen(temp11) >= 2 && strlen(temp12) >= 2){			//check apabila penamaan zone kosong
					sprintf(buffer1, "ZONE %s & %s AKTIF",temp11, temp12);
					LCD_Putsxy(0,1, buffer1);
				}else{
					LCD_Putsxy(0,1, "Segment 11 & 12 AKTIF");
				}	
				buzzerBlink(1000);
				sendDataSegment(); 		// SEND TO F1
				if(!buttonPress(BUTTON_RESET_PORT, BUTTON_RESET_PIN, 250)){
					LCD_Clear();
					relayOff(0);
					relayOff(1);
					buzzerOff(0);
					break;
					break;
				}
			}				
		}
		else if(currentSegment[11] > thresholdSegment[11]){
			/* PRE ALARM */
			// PESAN KE LCD
			LCD_Clear();
			while(1){
			if(strlen(temp12) >= 2){			//check apabila penamaan zone kosong
				sprintf(buffer1, "ZONE %s AKTIF",temp12);
				LCD_Putsxy(0,1, buffer1);
			}else{
				LCD_Putsxy(0,1, "Segment 12 AKTIF");
			}
			// DATA TO SCADA
				 dataSeg[11] = 2;
			// BUZZERR BLINK
			buzzerBlink(1000);
			sendDataSegment(); 		// SEND TO F1
			if(!buttonPress(BUTTON_RESET_PORT, BUTTON_RESET_PIN, 250)){
				LCD_Clear();
				buzzerOff(0);
				break;
			}
			
