rizkyzullfhamy/FireAlarm_Mutant_STM32F4/MDK-ARM/SENSOR.c
			if((currentSegment[10] > thresholdSegment[10])){
				LCD_Clear();
				buzzerOff(0);
				goto sensor12_11;
			}
		}
		//if((currentSegment[10] > thresholdSegment[10]) && (currentSegment[11] > thresholdSegment[11])){
		sensor12_11:
			LCD_Clear();
		/* FIRE ALARM ACTIVE */
		while(1){
			// AKTIFKAN RELAY 0
				relayOn(10);
				relayOn(11);
			// DATA TO SCADA
				 dataSeg[10] = 2;
				 dataSeg[11] = 2;			
			// PESAN KE LCD
				if(strlen(temp11) >= 2 && strlen(temp12) >= 2){			//check apabila penamaan zone kosong
					sprintf(buffer1, "ZONE %s & %s AKTIF",temp11, temp12);
					LCD_Putsxy(0,1, buffer1);
				}else{
					LCD_Putsxy(0,1, "Segment 11 & 12 AKTIF");
				}
				DWT_Delayms(1000);
				sendDataSegment(); 		// SEND TO F1
				if(!buttonPress(BUTTON_RESET_PORT, BUTTON_RESET_PIN, 250)){
					LCD_Clear();
					relayOff(10);
					relayOff(11);
					buzzerOff(0);
					break;
					break;
				}
			}
	}else if(currentSegment[10] > openShortCircuit[10] && currentSegment[10] < thresholdSegment[10]){
				/* KONDISI AMAN SEGMENT 1*/
				//LCD_Clear();
				// DATA TO SCADA
				 dataSeg[10] = 0;
				 sendDataSegment(); 		// SEND TO F1
				if(currentSegment[11] > openShortCircuit[11] && currentSegment[11] < thresholdSegment[11]){
					/* KONDISI AMAN SEGMENT 1*/
					//LCD_Clear();
				  // DATA TO SCADA
				  dataSeg[11] = 0;
					sendDataSegment(); 		// SEND TO F1
				}
	}else if(currentSegment[11] > openShortCircuit[11] && currentSegment[11] < thresholdSegment[11]){
				/* KONDISI AMAN SEGMENT 2*/
				//LCD_Clear();
				// DATA TO SCADA
				dataSeg[11] = 0;
				sendDataSegment(); 		// SEND TO F1		
				if(currentSegment[10] > openShortCircuit[10] && currentSegment[10] < thresholdSegment[10]){
					/* KONDISI AMAN SEGMENT 1*/
					//LCD_Clear();
				  // DATA TO SCADA
				  dataSeg[10] = 0;
					sendDataSegment(); 		// SEND TO F1
				}	
	}
	
	/* ===============SEGMENT 13 DAN 14===================== */
		if(currentSegment[12] > thresholdSegment[12]){
			/* PRE ALARM */
			// PESAN KE LCD
			LCD_Clear();
			while(1){
			if(strlen(temp13) >= 2){			//check apabila penamaan zone kosong
				sprintf(buffer1, "ZONE %s AKTIF",temp13);
				LCD_Putsxy(0,1, buffer1);
			}else{
				LCD_Putsxy(0,1, "Segment 13 AKTIF");
			}
			// DATA TO SCADA
				 dataSeg[12] = 2;
			// BUZZERR BLINK
			buzzerBlink(1000);
			sendDataSegment(); 		// SEND TO F1
			if(!buttonPress(BUTTON_RESET_PORT, BUTTON_RESET_PIN, 250)){
				LCD_Clear();
				buzzerOff(0);
				break;
			}
			
			if((currentSegment[13] > thresholdSegment[13])){
				LCD_Clear();
				buzzerOff(0);
				goto sensor13_14;
			}
		}
		//if((currentSegment[12] > thresholdSegment[12]) && (currentSegment[13] > thresholdSegment[13])){
		sensor13_14:
			LCD_Clear();
		/* FIRE ALARM ACTIVE */
		while(1){
			// AKTIFKAN RELAY 0
				relayOn(12);
				relayOn(13);
			// DATA TO SCADA
				 dataSeg[12] = 2;
				 dataSeg[13] = 2;		
			// PESAN KE LCD
				if(strlen(temp13) >= 2 && strlen(temp14) >= 2){			//check apabila penamaan zone kosong
					sprintf(buffer1, "ZONE %s & %s AKTIF",temp13, temp14);
					LCD_Putsxy(0,1, buffer1);
				}else{
					LCD_Putsxy(0,1, "Segment 13 & 14 AKTIF");
				}
				buzzerBlink(1000);
				sendDataSegment(); 		// SEND TO F1
				if(!buttonPress(BUTTON_RESET_PORT, BUTTON_RESET_PIN, 250)){
					LCD_Clear();
					relayOff(12);
					relayOff(13);
					buzzerOff(0);
					break;
					break;
				}
			}
	}
		else if(currentSegment[13] > thresholdSegment[13]){
			/* PRE ALARM */
			// PESAN KE LCD
			LCD_Clear();
			while(1){
			if(strlen(temp14) >= 2){			//check apabila penamaan zone kosong
				sprintf(buffer1, "ZONE %s AKTIF",temp14);
				LCD_Putsxy(0,1, buffer1);
			}else{
				LCD_Putsxy(0,1, "Segment 14 AKTIF");
			}
			// DATA TO SCADA
				 dataSeg[13] = 2;
			// BUZZERR BLINK
			buzzerBlink(1000);
			sendDataSegment(); 		// SEND TO F1
			if(!buttonPress(BUTTON_RESET_PORT, BUTTON_RESET_PIN, 250)){
				LCD_Clear();
				buzzerOff(0);
				break;
			}
			
			if((currentSegment[12] > thresholdSegment[12])){
				LCD_Clear();
				buzzerOff(0);
				goto sensor14_13;
			}
		}
		//if((currentSegment[12] > thresholdSegment[12]) && (currentSegment[13] > thresholdSegment[13])){
		sensor14_13:
			LCD_Clear();
		/* FIRE ALARM ACTIVE */
		while(1){
			// AKTIFKAN RELAY 0
				relayOn(12);
				relayOn(13);
			// DATA TO SCADA
				 dataSeg[12] = 2;
				 dataSeg[13] = 2;		
			// PESAN KE LCD
				if(strlen(temp13) >= 2 && strlen(temp14) >= 2){			//check apabila penamaan zone kosong
					sprintf(buffer1, "ZONE %s & %s AKTIF",temp13, temp14);
					LCD_Putsxy(0,1, buffer1);
				}else{
					LCD_Putsxy(0,1, "Segment 13 & 14 AKTIF");
				}
				buzzerBlink(1000);
				sendDataSegment(); 		// SEND TO F1
				if(!buttonPress(BUTTON_RESET_PORT, BUTTON_RESET_PIN, 250)){
					LCD_Clear();
					relayOff(12);
					relayOff(13);
					buzzerOff(0);
					break;
					break;
				}
			}
	}else if(currentSegment[12] > openShortCircuit[12] && currentSegment[12] < thresholdSegment[12]){
				/* KONDISI AMAN SEGMENT 1*/
				//LCD_Clear();
				// DATA TO SCADA
				 dataSeg[12] = 0;
				sendDataSegment(); 		// SEND TO F1
				if(currentSegment[13] > openShortCircuit[13] && currentSegment[13] < thresholdSegment[13]){
					/* KONDISI AMAN SEGMENT 1*/
					//LCD_Clear();
				  // DATA TO SCADA
				  dataSeg[13] = 0;
					sendDataSegment(); 		// SEND TO F1
				}
	}else if(currentSegment[13] > openShortCircuit[13] && currentSegment[13] < thresholdSegment[13]){
				/* KONDISI AMAN SEGMENT 2*/
				//LCD_Clear();
				// DATA TO SCADA
				 dataSeg[13] = 0;		
				sendDataSegment(); 		// SEND TO F1
				if(currentSegment[12] > openShortCircuit[12] && currentSegment[12] < thresholdSegment[12]){
					/* KONDISI AMAN SEGMENT 1*/
					//LCD_Clear();
				  // DATA TO SCADA
				  dataSeg[12] = 0;
					sendDataSegment(); 		// SEND TO F1
				}	
	}
	
	/* ===============SEGMENT 15 DAN 16===================== */
		if(currentSegment[14] > thresholdSegment[14]){
			/* PRE ALARM */
			// PESAN KE LCD
			LCD_Clear();
			while(1){
			if(strlen(temp15) >= 2){			//check apabila penamaan zone kosong
				sprintf(buffer1, "ZONE %s AKTIF",temp15);
				LCD_Putsxy(0,1, buffer1);
			}else{
				LCD_Putsxy(0,1, "Segment 15 AKTIF");
			}
			// DATA TO SCADA
				 dataSeg[14] = 2;
			// BUZZERR BLINK
			buzzerBlink(1000);
			sendDataSegment(); 		// SEND TO F1
			if(!buttonPress(BUTTON_RESET_PORT, BUTTON_RESET_PIN, 250)){
				LCD_Clear();
				buzzerOff(0);
				break;
			}
			
			if((currentSegment[15] > thresholdSegment[15])){
				LCD_Clear();
				buzzerOff(0);
				goto sensor15_16;
			}
		}
		//if((currentSegment[14] > thresholdSegment[14]) && (currentSegment[15] > thresholdSegment[15])){
		sensor15_16:
			LCD_Clear();
		/* FIRE ALARM ACTIVE */
			while(1){
			// AKTIFKAN RELAY 0
				relayOn(14);
				relayOn(15);
			// DATA TO SCADA
				 dataSeg[14] = 2;
				 dataSeg[15] = 2;		
			// PESAN KE LCD
				if(strlen(temp15) >= 2 && strlen(temp16) >= 2){			//check apabila penamaan zone kosong
					sprintf(buffer1, "ZONE %s & %s AKTIF",temp15, temp16);
					LCD_Putsxy(0,1, buffer1);
				}else{
					LCD_Putsxy(0,1, "Segment 15 & 16 AKTIF");
				}
				buzzerBlink(1000);
				sendDataSegment(); 		// SEND TO F1
				if(!buttonPress(BUTTON_RESET_PORT, BUTTON_RESET_PIN, 250)){
					LCD_Clear();
					relayOff(14);
					relayOff(15);
					buzzerOff(0);
					break;
					break;
				}
			}				
	}
		else if(currentSegment[15] > thresholdSegment[15]){
			/* PRE ALARM */
			// PESAN KE LCD
			LCD_Clear();
			while(1){
			if(strlen(temp16) >= 2){			//check apabila penamaan zone kosong
				sprintf(buffer1, "ZONE %s AKTIF",temp16);
				LCD_Putsxy(0,1, buffer1);
			}else{
				LCD_Putsxy(0,1, "Segment 16 AKTIF");
			}
			// DATA TO SCADA
				 dataSeg[15] = 2;
			// BUZZERR BLINK
			buzzerBlink(1000);
			sendDataSegment(); 		// SEND TO F1
			if(!buttonPress(BUTTON_RESET_PORT, BUTTON_RESET_PIN, 250)){
				LCD_Clear();
				buzzerOff(0);
				break;
			}
			
