rizkyzullfhamy/FireAlarm_Mutant_STM32F4/MDK-ARM/SENSOR.c
			if((currentSegment[14] > thresholdSegment[14])){
				LCD_Clear();
				buzzerOff(0);
				goto sensor16_15;
			}
		}
		//if((currentSegment[14] > thresholdSegment[14]) && (currentSegment[15] > thresholdSegment[15])){
		sensor16_15:	
			LCD_Clear();
		/* FIRE ALARM ACTIVE */
			while(1){
			// AKTIFKAN RELAY 0
				relayOn(14);
				relayOn(15);
			// DATA TO SCADA
				 dataSeg[14] = 2;
				 dataSeg[15] = 2;	
			// PESAN KE LCD
				if(strlen(temp15) >= 2 && strlen(temp16) >= 2){			//check apabila penamaan zone kosong
					sprintf(buffer1, "ZONE %s & %s AKTIF",temp15, temp16);
					LCD_Putsxy(0,1, buffer1);
				}else{
					LCD_Putsxy(0,1, "Segment 15 & 16 AKTIF");
				}
				buzzerBlink(1000);
				sendDataSegment(); 		// SEND TO F1
				
				if(!buttonPress(BUTTON_RESET_PORT, BUTTON_RESET_PIN, 250)){
					LCD_Clear();
					relayOff(14);
					relayOff(15);
					buzzerOff(0);
					break;
					break;
				}
		}
	}else if(currentSegment[14] > openShortCircuit[14] && currentSegment[14] < thresholdSegment[14]){
				/* KONDISI AMAN SEGMENT 1*/
				//LCD_Clear();
				// DATA TO SCADA
				 dataSeg[14] = 0;
				sendDataSegment(); 		// SEND TO F1
				if(currentSegment[15] > openShortCircuit[15] && currentSegment[15] < thresholdSegment[15]){
					/* KONDISI AMAN SEGMENT 1*/
					//LCD_Clear();
				  // DATA TO SCADA
				  dataSeg[15] = 0;
					sendDataSegment(); 		// SEND TO F1
				}
	}else if(currentSegment[15] > openShortCircuit[15] && currentSegment[15] < thresholdSegment[15]){
				/* KONDISI AMAN SEGMENT 2*/
				//LCD_Clear();
				// DATA TO SCADA
				 dataSeg[15] = 0;		
				sendDataSegment(); 		// SEND TO F1
				if(currentSegment[14] > openShortCircuit[14] && currentSegment[14] < thresholdSegment[14]){
					/* KONDISI AMAN SEGMENT 1*/
					//LCD_Clear();
				  // DATA TO SCADA
				  dataSeg[14] = 0;
					sendDataSegment(); 		// SEND TO F1
				}	
	}	
}
//void modeCrossWire(void){
//	/* ==================SEGMENT 1 DAN 2==================*/
//	if(currentSegment[0] > thresholdSegment[0]){
//			/* PRE ALARM */
//			// PESAN KE LCD
//			LCD_Clear();
//			if(strlen(temp1) >= 2){			//check apabila penamaan zone kosong
//				sprintf(buffer1, "ZONE %s AKTIF",temp1);
//				LCD_Putsxy(0,1, buffer1);
//			}else{
//				LCD_Putsxy(0,1, "Segment 1 AKTIF");
//			}
//			// DATA TO SCADA
//			dataSeg[0] = 1;
//			// BUZZERR BLINK
//			buzzerBlink(1000);
//			LCD_Clear();
//			sendDataSegment(); 		// SEND TO F1
//		if((currentSegment[0] > thresholdSegment[0]) && (currentSegment[1] > thresholdSegment[1])){
//			/* FIRE ALARM ACTIVE */
//			// AKTIFKAN RELAY 0
//				relayOn(0);
//				relayOn(1);
//			// DATA TO SCADA
//				 dataSeg[0] = 2;
//				 dataSeg[1] = 2;
//			// PESAN KE LCD
//				if(strlen(temp1) >= 2 && strlen(temp2) >= 2){			//check apabila penamaan zone kosong
//					sprintf(buffer1, "ZONE %s & %s AKTIF",temp1, temp2);
//					LCD_Putsxy(0,1, buffer1);
//				}else{
//					LCD_Putsxy(0,1, "Segment 1 & 2 AKTIF");
//				}
//				DWT_Delayms(1000);
//				sendDataSegment(); 		// SEND TO F1
//			}else{
//				// NONAKTIF RELAY
//				relayOff(0);
//				relayOff(1);
//				LCD_Clear();
//		}		
//	}else if(currentSegment[1] > thresholdSegment[1]){
//			/* PRE ALARM */
//			// PESAN KE LCD
//			LCD_Clear();
//			if(strlen(temp2) >= 2){			//check apabila penamaan zone kosong
//				sprintf(buffer1, "ZONE %s AKTIF",temp2);
//				LCD_Putsxy(0,1, buffer1);
//			}else{
//				LCD_Putsxy(0,1, "Segment 2 AKTIF");
//			}
//			// DATA TO SCADA
//			dataSeg[1] = 1;
//			// BUZZERR BLINK
//			buzzerBlink(1000);
//			LCD_Clear();
//			sendDataSegment(); 		// SEND TO F1
//		if((currentSegment[0] > thresholdSegment[0]) && (currentSegment[1] > thresholdSegment[1])){
//			/* FIRE ALARM ACTIVE */
//			// AKTIFKAN RELAY 0
//				relayOn(0);
//				relayOn(1);
//			// DATA TO SCADA
//				 dataSeg[0] = 2;
//				 dataSeg[1] = 2;
//			// PESAN KE LCD
//				if(strlen(temp1) >= 2 && strlen(temp2) >= 2){			//check apabila penamaan zone kosong
//					sprintf(buffer1, "ZONE %s & %s AKTIF",temp1, temp2);
//					LCD_Putsxy(0,1, buffer1);
//				}else{
//					LCD_Putsxy(0,1, "Segment 1 & 2 AKTIF");
//				}
//				DWT_Delayms(1000);
//				sendDataSegment(); 		// SEND TO F1
//			}else{
//				// NONAKTIF RELAY
//				relayOff(0);
//				relayOff(1);
//				LCD_Clear();
//		}
//	}else if(currentSegment[0] > openShortCircuit[0] && currentSegment[0] < thresholdSegment[0]){
//				/* KONDISI AMAN SEGMENT 1*/
//				LCD_Clear();
//				// DATA TO SCADA
//				 dataSeg[0] = 0;
//				sendDataSegment(); 		// SEND TO F1
//				if(currentSegment[1] > openShortCircuit[1] && currentSegment[1] < thresholdSegment[1]){
//					/* KONDISI AMAN SEGMENT 1*/
//					LCD_Clear();
//				  // DATA TO SCADA
//				  dataSeg[1] = 0;
//					sendDataSegment(); 		// SEND TO F1
//				}
//	}else if(currentSegment[1] > openShortCircuit[1] && currentSegment[1] < thresholdSegment[1]){
//				/* KONDISI AMAN SEGMENT 2*/
//				LCD_Clear();
//				// DATA TO SCADA
//				dataSeg[1] = 0;
//				sendDataSegment(); 		// SEND TO F1		
//				if(currentSegment[0] > openShortCircuit[0] && currentSegment[0] < thresholdSegment[0]){
//					/* KONDISI AMAN SEGMENT 1*/
//					LCD_Clear();
//				  // DATA TO SCADA
//				  dataSeg[0] = 0;
//					sendDataSegment(); 		// SEND TO F1
//				}	
//	}
//	
//		/* ===============SEGMENT 3 DAN 4===================== */
//		if(currentSegment[2] > thresholdSegment[2]){
//			/* PRE ALARM */
//			// PESAN KE LCD
//			LCD_Clear();
//			if(strlen(temp3) >= 2){			//check apabila penamaan zone kosong
//				sprintf(buffer1, "ZONE %s AKTIF",temp3);
//				LCD_Putsxy(0,1, buffer1);
//			}else{
//				LCD_Putsxy(0,1, "Segment 3 AKTIF");
//			}
//			// DATA TO SCADA
//			dataSeg[2] = 1;
//			// BUZZERR BLINK
//			buzzerBlink(1000);
//			LCD_Clear();
//			sendDataSegment(); 		// SEND TO F1
//		if((currentSegment[2] > thresholdSegment[2]) && (currentSegment[3] > thresholdSegment[3])){
//			/* FIRE ALARM ACTIVE */
//			// AKTIFKAN RELAY 0
//				relayOn(2);
//				relayOn(3);
//			// DATA TO SCADA
//				 dataSeg[2] = 2;
//				 dataSeg[3] = 2;
//			// PESAN KE LCD
//				if(strlen(temp3) >= 2 && strlen(temp4) >= 2){			//check apabila penamaan zone kosong
//					sprintf(buffer1, "ZONE %s & %s AKTIF",temp3, temp4);
//					LCD_Putsxy(0,1, buffer1);
//				}else{
//					LCD_Putsxy(0,1, "Segment 3 & 4 AKTIF");
//				}
//				DWT_Delayms(1000);
//				sendDataSegment(); 		// SEND TO F1
//			}else{
//				// NONAKTIF RELAY
//				relayOff(2);
//				relayOff(3);
//				LCD_Clear();
//		}		
//	}else if(currentSegment[3] > thresholdSegment[3]){
//			/* PRE ALARM */
//			// PESAN KE LCD
//			LCD_Clear();		
//			if(strlen(temp4) >= 2){			//check apabila penamaan zone kosong
//				sprintf(buffer1, "ZONE %s AKTIF",temp4);
//				LCD_Putsxy(0,1, buffer1);
//			}else{
//				LCD_Putsxy(0,1, "Segment 4 AKTIF");
//			}
//			// DATA TO SCADA
//			dataSeg[3] = 1;
//			// BUZZERR BLINK
//			buzzerBlink(1000);
//			LCD_Clear();
//			sendDataSegment(); 		// SEND TO F1
//		if((currentSegment[2] > thresholdSegment[2]) && (currentSegment[3] > thresholdSegment[3])){
//			/* FIRE ALARM ACTIVE */
//			// AKTIFKAN RELAY 0
//				relayOn(2);
//				relayOn(3);
//			// DATA TO SCADA
//				 dataSeg[2] = 2;
//				 dataSeg[3] = 2;		
//			// PESAN KE LCD
//				if(strlen(temp3) >= 2 && strlen(temp4) >= 2){			//check apabila penamaan zone kosong
//					sprintf(buffer1, "ZONE %s & %s AKTIF",temp3, temp4);
//					LCD_Putsxy(0,1, buffer1);
//				}else{
//					LCD_Putsxy(0,1, "Segment 3 & 4 AKTIF");
//				}
//				DWT_Delayms(1000);
//				sendDataSegment(); 		// SEND TO F1
//			}else{
//				// NONAKTIF RELAY
//				relayOff(2);
//				relayOff(3);
//				LCD_Clear();
//		}
//	}else if(currentSegment[2] > openShortCircuit[2] && currentSegment[2] < thresholdSegment[2]){
//				/* KONDISI AMAN SEGMENT 1*/
//				LCD_Clear();
//				// DATA TO SCADA
//				 dataSeg[2] = 0;
//				sendDataSegment(); 		// SEND TO F1
//				if(currentSegment[3] > openShortCircuit[3] && currentSegment[3] < thresholdSegment[3]){
//					/* KONDISI AMAN SEGMENT 1*/
//					LCD_Clear();
//				  // DATA TO SCADA
//				  dataSeg[3] = 0;
//				  sendDataSegment(); 		// SEND TO F1
//				}
//	}else if(currentSegment[3] > openShortCircuit[3] && currentSegment[3] < thresholdSegment[3]){
//				/* KONDISI AMAN SEGMENT 2*/
//				LCD_Clear();
//				// DATA TO SCADA
//				 dataSeg[3] = 0;		
//				 sendDataSegment(); 		// SEND TO F1
//				if(currentSegment[2] > openShortCircuit[2] && currentSegment[2] < thresholdSegment[2]){
//					/* KONDISI AMAN SEGMENT 1*/
//					LCD_Clear();
//				  // DATA TO SCADA
//				  dataSeg[2] = 0;
//				  sendDataSegment(); 		// SEND TO F1
//				}	
//	}
//	/* ===============SEGMENT 5 DAN 6===================== */
//		if(currentSegment[4] > thresholdSegment[4]){
//			/* PRE ALARM */
//			// PESAN KE LCD
//			LCD_Clear();	
//			if(strlen(temp5) >= 2){			//check apabila penamaan zone kosong
//				sprintf(buffer1, "ZONE %s AKTIF",temp5);
//				LCD_Putsxy(0,1, buffer1);
//			}else{
//				LCD_Putsxy(0,1, "Segment 5 AKTIF");
//			}
//			// DATA TO SCADA
//			dataSeg[4] = 1;
//			// BUZZERR BLINK
//			buzzerBlink(1000);
//			LCD_Clear();
//			sendDataSegment(); 		// SEND TO F1
//		if((currentSegment[4] > thresholdSegment[4]) && (currentSegment[5] > thresholdSegment[5])){
//			/* FIRE ALARM ACTIVE */
//			// AKTIFKAN RELAY 0
//				relayOn(4);
//				relayOn(5);
//			// DATA TO SCADA
//				 dataSeg[4] = 2;
//				 dataSeg[5] = 2;	
//			// PESAN KE LCD
//				if(strlen(temp5) >= 2 && strlen(temp6) >= 2){			//check apabila penamaan zone kosong
//					sprintf(buffer1, "ZONE %s & %s AKTIF",temp5, temp6);
//					LCD_Putsxy(0,1, buffer1);
//				}else{
//					LCD_Putsxy(0,1, "Segment 5 & 6 AKTIF");
//				}
//				DWT_Delayms(1000);
//				sendDataSegment(); 		// SEND TO F1
//			}else{
//				// NONAKTIF RELAY
//				relayOff(4);
//				relayOff(5);
//				LCD_Clear();
//		}		
//	}else if(currentSegment[5] > thresholdSegment[5]){
//			/* PRE ALARM */
//			// PESAN KE LCD
//			LCD_Clear();
//			if(strlen(temp6) >= 2){			//check apabila penamaan zone kosong
//				sprintf(buffer1, "ZONE %s AKTIF",temp6);
//				LCD_Putsxy(0,1, buffer1);
//			}else{
//				LCD_Putsxy(0,1, "Segment 6 AKTIF");
//			}
//			// DATA TO SCADA
//			dataSeg[5] = 1;
//			// BUZZERR BLINK
//			buzzerBlink(1000);
//			LCD_Clear();
//			sendDataSegment(); 		// SEND TO F1
//		if((currentSegment[4] > thresholdSegment[4]) && (currentSegment[5] > thresholdSegment[5])){
//			/* FIRE ALARM ACTIVE */
//			// AKTIFKAN RELAY 0
//				relayOn(4);
//				relayOn(5);
//			// DATA TO SCADA
//				 dataSeg[4] = 2;
//				 dataSeg[5] = 2;	
//			// PESAN KE LCD
//				if(strlen(temp5) >= 2 && strlen(temp6) >= 2){			//check apabila penamaan zone kosong
//					sprintf(buffer1, "ZONE %s & %s AKTIF",temp5, temp6);
//					LCD_Putsxy(0,1, buffer1);
//				}else{
//					LCD_Putsxy(0,1, "Segment 5 & 6 AKTIF");
//				}
//				DWT_Delayms(1000);
//				sendDataSegment(); 		// SEND TO F1
//			}else{
//				// NONAKTIF RELAY
//				relayOff(4);
//				relayOff(5);
//				LCD_Clear();				
//		}
//	}else if(currentSegment[4] > openShortCircuit[4] && currentSegment[4] < thresholdSegment[4]){
//				/* KONDISI AMAN SEGMENT 1*/
//				LCD_Clear();
//				// DATA TO SCADA
//				 dataSeg[4] = 0;
//				sendDataSegment(); 		// SEND TO F1
//				if(currentSegment[5] > openShortCircuit[5] && currentSegment[5] < thresholdSegment[5]){
//					/* KONDISI AMAN SEGMENT 1*/
//					LCD_Clear();
//				  // DATA TO SCADA
//				  dataSeg[5] = 0;
//				  sendDataSegment(); 		// SEND TO F1
//				}
//	}else if(currentSegment[5] > openShortCircuit[5] && currentSegment[5] < thresholdSegment[5]){
//				/* KONDISI AMAN SEGMENT 2*/
//				LCD_Clear();
//				// DATA TO SCADA
//				dataSeg[5] = 0;
//				sendDataSegment(); 		// SEND TO F1		
//				if(currentSegment[4] > openShortCircuit[4] && currentSegment[4] < thresholdSegment[4]){
//					/* KONDISI AMAN SEGMENT 1*/
//					LCD_Clear();
//				  // DATA TO SCADA
//				  dataSeg[4] = 0;
//				  sendDataSegment(); 		// SEND TO F1
//				}	
//	}
//	
//	/* ===============SEGMENT 7 DAN 8===================== */
//		if(currentSegment[6] > thresholdSegment[6]){
//			/* PRE ALARM */
//			// PESAN KE LCD
//			LCD_Clear();
//			if(strlen(temp7) >= 2){			//check apabila penamaan zone kosong
//				sprintf(buffer1, "ZONE %s AKTIF",temp7);
//				LCD_Putsxy(0,1, buffer1);
//			}else{
//				LCD_Putsxy(0,1, "Segment 7 AKTIF");
//			}
//			// DATA TO SCADA
//			dataSeg[6] = 2;
//			// BUZZERR BLINK
//			buzzerBlink(2000);
//			LCD_Clear();
//			sendDataSegment(); 		// SEND TO F1
//		if((currentSegment[6] > thresholdSegment[6]) && (currentSegment[7] > thresholdSegment[7])){
//			/* FIRE ALARM ACTIVE */
//			// AKTIFKAN RELAY 0
//				relayOn(6);
//				relayOn(7);
//			// DATA TO SCADA
//				 dataSeg[6] = 2;
//				 dataSeg[7] = 2;	
//			// PESAN KE LCD
//				if(strlen(temp8) >= 2 && strlen(temp7) >= 2){			//check apabila penamaan zone kosong
//					sprintf(buffer1, "ZONE %s & %s AKTIF",temp7, temp8);
//					LCD_Putsxy(0,1, buffer1);
//				}else{
//					LCD_Putsxy(0,1, "Segment 7 & 8 AKTIF");
//				}
//				DWT_Delayms(1000);
//				sendDataSegment(); 		// SEND TO F1
//			}else{
//				// NONAKTIF RELAY
//				relayOff(6);
//				relayOff(7);
//				LCD_Clear();
//		}		
//	}else if(currentSegment[7] > thresholdSegment[7]){
//			/* PRE ALARM */
//			// PESAN KE LCD
//			LCD_Clear();		
//			if(strlen(temp8) >= 2){			//check apabila penamaan zone kosong
//				sprintf(buffer1, "ZONE %s AKTIF",temp8);
//				LCD_Putsxy(0,1, buffer1);
//			}else{
//				LCD_Putsxy(0,1, "Segment 8 AKTIF");
//			}
//			// DATA TO SCADA
//			dataSeg[7] = 2;
//			// BUZZERR BLINK
//			buzzerBlink(1000);
//			LCD_Clear();
//			sendDataSegment(); 		// SEND TO F1
//		if((currentSegment[6] > thresholdSegment[6]) && (currentSegment[7] > thresholdSegment[7])){
//			/* FIRE ALARM ACTIVE */
//			// AKTIFKAN RELAY 0
//				relayOn(6);
//				relayOn(7);
//			// DATA TO SCADA
//				 dataSeg[6] = 2;
//				 dataSeg[7] = 2;	
//			// PESAN KE LCD
//				if(strlen(temp8) >= 2 && strlen(temp7) >= 2){			//check apabila penamaan zone kosong
//					sprintf(buffer1, "ZONE %s & %s AKTIF",temp7, temp8);
//					LCD_Putsxy(0,1, buffer1);
//				}else{
//					LCD_Putsxy(0,1, "Segment 7 & 8 AKTIF");
//				}
//				DWT_Delayms(1000);
//				sendDataSegment(); 		// SEND TO F1
//			}else{
//				// NONAKTIF RELAY
//				relayOff(6);
//				relayOff(7);
//			  LCD_Clear();
//		}
//	}else if(currentSegment[6] > openShortCircuit[6] && currentSegment[6] < thresholdSegment[6]){
//				/* KONDISI AMAN SEGMENT 1*/
//				LCD_Clear();
//				// DATA TO SCADA
//				 dataSeg[6] = 0;
//				sendDataSegment(); 		// SEND TO F1
//				if(currentSegment[7] > openShortCircuit[7] && currentSegment[7] < thresholdSegment[7]){
//					/* KONDISI AMAN SEGMENT 1*/
//					LCD_Clear();
//				  // DATA TO SCADA
//				  dataSeg[7] = 0;
//					sendDataSegment(); 		// SEND TO F1
//				}
//	}else if(currentSegment[7] > openShortCircuit[7] && currentSegment[7] < thresholdSegment[7]){
//				/* KONDISI AMAN SEGMENT 2*/
//				LCD_Clear();
//				// DATA TO SCADA
//				 dataSeg[7] = 0;		
//				if(currentSegment[6] > openShortCircuit[6] && currentSegment[6] < thresholdSegment[6]){
//					/* KONDISI AMAN SEGMENT 1*/
//					LCD_Clear();
//				  // DATA TO SCADA
//				  dataSeg[6] = 0;
//					sendDataSegment(); 		// SEND TO F1
//				}	
//	}
//	
//	/* ===============SEGMENT 9 DAN 10===================== */
//		if(currentSegment[8] > thresholdSegment[8]){
//			/* PRE ALARM */
//			// PESAN KE LCD
//			LCD_Clear();		
//			if(strlen(temp9) >= 2){			//check apabila penamaan zone kosong
//				sprintf(buffer1, "ZONE %s AKTIF",temp9);
//				LCD_Putsxy(0,1, buffer1);
//			}else{
//				LCD_Putsxy(0,1, "Segment 9 AKTIF");
//			}
//			// DATA TO SCADA
//			dataSeg[8] = 2;
//			// BUZZERR BLINK
//			buzzerBlink(1000);
//			LCD_Clear();		
//			sendDataSegment(); 		// SEND TO F1
//		if((currentSegment[8] > thresholdSegment[8]) && (currentSegment[9] > thresholdSegment[9])){
//			/* FIRE ALARM ACTIVE */
//			// AKTIFKAN RELAY 0
//				relayOn(8);
//				relayOn(9);
//			// DATA TO SCADA
//				 dataSeg[8] = 2;
//				 dataSeg[9] = 2;	
//			// PESAN KE LCD
//				if(strlen(temp9) >= 2 && strlen(temp10) >= 2){			//check apabila penamaan zone kosong
//					sprintf(buffer1, "ZONE %s & %s AKTIF",temp9, temp10);
//					LCD_Putsxy(0,1, buffer1);
//				}else{
//					LCD_Putsxy(0,1, "Segment 9 & 10 AKTIF");
//				}	
//				DWT_Delayms(1000);
//				sendDataSegment(); 		// SEND TO F1
//			}else{
//				// NONAKTIF RELAY
//				relayOff(8);
//				relayOff(9);
//			  LCD_Clear();		
//		}		
//	}else if(currentSegment[9] > thresholdSegment[9]){
//			/* PRE ALARM */
//			// PESAN KE LCD
//			LCD_Clear();	
//			if(strlen(temp10) >= 2){			//check apabila penamaan zone kosong
//				sprintf(buffer1, "ZONE %s AKTIF",temp10);
//				LCD_Putsxy(0,1, buffer1);
//			}else{
//				LCD_Putsxy(0,1, "Segment 10 AKTIF");
//			}		
//			// DATA TO SCADA
//			dataSeg[9] = 2;		
//			// BUZZERR BLINK
//			buzzerBlink(1000);
//			LCD_Clear();	
//			sendDataSegment(); 		// SEND TO F1		
//		if((currentSegment[8] > thresholdSegment[8]) && (currentSegment[9] > thresholdSegment[9])){
//			/* FIRE ALARM ACTIVE */
//			// AKTIFKAN RELAY 0
//				relayOn(8);
//				relayOn(9);
//			// DATA TO SCADA
//				 dataSeg[8] = 2;
//				 dataSeg[9] = 2;	
//			// PESAN KE LCD
//				if(strlen(temp9) >= 2 && strlen(temp10) >= 2){			//check apabila penamaan zone kosong
//					sprintf(buffer1, "ZONE %s & %s AKTIF",temp9, temp10);
//					LCD_Putsxy(0,1, buffer1);
//				}else{
//					LCD_Putsxy(0,1, "Segment 9 & 10 AKTIF");
//				}	
//				DWT_Delayms(1000);
//				sendDataSegment(); 		// SEND TO F1
//			}else{
//				// NONAKTIF RELAY
//				relayOff(8);
//				relayOff(9);
//			  LCD_Clear();		
//		}
//	}else if(currentSegment[8] > openShortCircuit[8] && currentSegment[8] < thresholdSegment[8]){
//				/* KONDISI AMAN SEGMENT 1*/
//				LCD_Clear();
//				// DATA TO SCADA
//				 dataSeg[8] = 0;
//				sendDataSegment(); 		// SEND TO F1
//				if(currentSegment[9] > openShortCircuit[9] && currentSegment[9] < thresholdSegment[9]){
//					/* KONDISI AMAN SEGMENT 1*/
//					LCD_Clear();
//				  // DATA TO SCADA
//				  dataSeg[9] = 0;
//					sendDataSegment(); 		// SEND TO F1
//				}
//	}else if(currentSegment[9] > openShortCircuit[9] && currentSegment[9] < thresholdSegment[9]){
//				/* KONDISI AMAN SEGMENT 2*/
//				LCD_Clear();
//				// DATA TO SCADA
//				dataSeg[9] = 0;
//				sendDataSegment(); 		// SEND TO F1		
//				if(currentSegment[8] > openShortCircuit[8] && currentSegment[8] < thresholdSegment[8]){
//					/* KONDISI AMAN SEGMENT 1*/
//					LCD_Clear();
//				  // DATA TO SCADA
//				  dataSeg[8] = 0;
//					sendDataSegment(); 		// SEND TO F1
//				}	
//	}
//	
//	/* ===============SEGMENT 11 DAN 12===================== */
//		if(currentSegment[10] > thresholdSegment[10]){
//			/* PRE ALARM */
//			// PESAN KE LCD
//			LCD_Clear();
//			if(strlen(temp11) >= 2){			//check apabila penamaan zone kosong
//				sprintf(buffer1, "ZONE %s AKTIF",temp11);
//				LCD_Putsxy(0,1, buffer1);
//			}else{
//				LCD_Putsxy(0,1, "Segment 11 AKTIF");
//			}		
//			// DATA TO SCADA
//				 dataSeg[10] = 2;
//			// BUZZERR BLINK
//			buzzerBlink(1000);
//			LCD_Clear();
//			sendDataSegment(); 		// SEND TO F1
//		if((currentSegment[10] > thresholdSegment[10]) && (currentSegment[11] > thresholdSegment[11])){
//			/* FIRE ALARM ACTIVE */
//			// AKTIFKAN RELAY 0
//				relayOn(10);
//				relayOn(11);
//			// DATA TO SCADA
//				 dataSeg[10] = 2;
//				 dataSeg[11] = 2;	
//			// PESAN KE LCD
//				if(strlen(temp11) >= 2 && strlen(temp12) >= 2){			//check apabila penamaan zone kosong
//					sprintf(buffer1, "ZONE %s & %s AKTIF",temp11, temp12);
//					LCD_Putsxy(0,1, buffer1);
//				}else{
//					LCD_Putsxy(0,1, "Segment 11 & 12 AKTIF");
//				}	
//				DWT_Delayms(1000);
//				sendDataSegment(); 		// SEND TO F1
//			}else{
//				// NONAKTIF RELAY
//				relayOff(10);
//				relayOff(11);
//			  LCD_Clear();
//		}		
//	}else if(currentSegment[11] > thresholdSegment[11]){
//			/* PRE ALARM */
//			// PESAN KE LCD
//			LCD_Clear();
//			if(strlen(temp12) >= 2){			//check apabila penamaan zone kosong
//				sprintf(buffer1, "ZONE %s AKTIF",temp12);
//				LCD_Putsxy(0,1, buffer1);
//			}else{
//				LCD_Putsxy(0,1, "Segment 12 AKTIF");
//			}
//			// DATA TO SCADA
//				 dataSeg[11] = 2;
//			// BUZZERR BLINK
//			buzzerBlink(1000);
//			LCD_Clear();
//			sendDataSegment(); 		// SEND TO F1
//		if((currentSegment[10] > thresholdSegment[10]) && (currentSegment[11] > thresholdSegment[11])){
//			/* FIRE ALARM ACTIVE */
//			// AKTIFKAN RELAY 0
//				relayOn(10);
//				relayOn(11);
//			// DATA TO SCADA
//				 dataSeg[10] = 2;
//				 dataSeg[11] = 2;			
//			// PESAN KE LCD
//				if(strlen(temp11) >= 2 && strlen(temp12) >= 2){			//check apabila penamaan zone kosong
//					sprintf(buffer1, "ZONE %s & %s AKTIF",temp11, temp12);
//					LCD_Putsxy(0,1, buffer1);
//				}else{
//					LCD_Putsxy(0,1, "Segment 11 & 12 AKTIF");
//				}
//				DWT_Delayms(1000);
//				sendDataSegment(); 		// SEND TO F1
//			}else{
//				// NONAKTIF RELAY
//				relayOff(10);
//				relayOff(11);
//			  LCD_Clear();
//		}
//	}else if(currentSegment[10] > openShortCircuit[10] && currentSegment[10] < thresholdSegment[10]){
//				/* KONDISI AMAN SEGMENT 1*/
//				LCD_Clear();
//				// DATA TO SCADA
//				 dataSeg[10] = 0;
//				 sendDataSegment(); 		// SEND TO F1
//				if(currentSegment[11] > openShortCircuit[11] && currentSegment[11] < thresholdSegment[11]){
//					/* KONDISI AMAN SEGMENT 1*/
//					LCD_Clear();
//				  // DATA TO SCADA
//				  dataSeg[11] = 0;
//					sendDataSegment(); 		// SEND TO F1
//				}
//	}else if(currentSegment[11] > openShortCircuit[11] && currentSegment[11] < thresholdSegment[11]){
//				/* KONDISI AMAN SEGMENT 2*/
//				LCD_Clear();
//				// DATA TO SCADA
//				dataSeg[11] = 0;
//				sendDataSegment(); 		// SEND TO F1		
//				if(currentSegment[10] > openShortCircuit[10] && currentSegment[10] < thresholdSegment[10]){
//					/* KONDISI AMAN SEGMENT 1*/
//					LCD_Clear();
//				  // DATA TO SCADA
//				  dataSeg[10] = 0;
//					sendDataSegment(); 		// SEND TO F1
//				}	
//	}
//	
//	/* ===============SEGMENT 13 DAN 14===================== */
//		if(currentSegment[12] > thresholdSegment[12]){
//			/* PRE ALARM */
//			// PESAN KE LCD
//			LCD_Clear();
//			if(strlen(temp13) >= 2){			//check apabila penamaan zone kosong
//				sprintf(buffer1, "ZONE %s AKTIF",temp13);
//				LCD_Putsxy(0,1, buffer1);
//			}else{
//				LCD_Putsxy(0,1, "Segment 13 AKTIF");
//			}
//			// DATA TO SCADA
//				 dataSeg[12] = 2;
//			// BUZZERR BLINK
//			buzzerBlink(1000);
//			LCD_Clear();
//			sendDataSegment(); 		// SEND TO F1
//		if((currentSegment[12] > thresholdSegment[12]) && (currentSegment[13] > thresholdSegment[13])){
//			/* FIRE ALARM ACTIVE */
//			// AKTIFKAN RELAY 0
//				relayOn(12);
//				relayOn(13);
//			// DATA TO SCADA
//				 dataSeg[12] = 2;
//				 dataSeg[13] = 2;		
//			// PESAN KE LCD
//				if(strlen(temp13) >= 2 && strlen(temp14) >= 2){			//check apabila penamaan zone kosong
//					sprintf(buffer1, "ZONE %s & %s AKTIF",temp13, temp14);
//					LCD_Putsxy(0,1, buffer1);
//				}else{
//					LCD_Putsxy(0,1, "Segment 13 & 14 AKTIF");
//				}
//				DWT_Delayms(1000);
//				sendDataSegment(); 		// SEND TO F1
//			}else{
//				// NONAKTIF RELAY
//				relayOff(12);
//				relayOff(13);
//			  LCD_Clear();
//		}		
//	}else if(currentSegment[13] > thresholdSegment[13]){
//			/* PRE ALARM */
//			// PESAN KE LCD
//			LCD_Clear();
//			if(strlen(temp14) >= 2){			//check apabila penamaan zone kosong
//				sprintf(buffer1, "ZONE %s AKTIF",temp14);
//				LCD_Putsxy(0,1, buffer1);
//			}else{
//				LCD_Putsxy(0,1, "Segment 14 AKTIF");
//			}
//			// DATA TO SCADA
//				 dataSeg[13] = 2;
//			// BUZZERR BLINK
//			buzzerBlink(1000);
//			LCD_Clear();
//			sendDataSegment(); 		// SEND TO F1
//		if((currentSegment[12] > thresholdSegment[12]) && (currentSegment[13] > thresholdSegment[13])){
