rizkyzullfhamy/FireAlarm_Mutant_STM32F4/MDK-ARM/SENSOR.c
//			/* FIRE ALARM ACTIVE */
//			// AKTIFKAN RELAY 0
//				relayOn(12);
//				relayOn(13);
//			// DATA TO SCADA
//				 dataSeg[12] = 2;
//				 dataSeg[13] = 2;		
//			// PESAN KE LCD
//				if(strlen(temp13) >= 2 && strlen(temp14) >= 2){			//check apabila penamaan zone kosong
//					sprintf(buffer1, "ZONE %s & %s AKTIF",temp13, temp14);
//					LCD_Putsxy(0,1, buffer1);
//				}else{
//					LCD_Putsxy(0,1, "Segment 13 & 14 AKTIF");
//				}
//				DWT_Delayms(1000);
//				sendDataSegment(); 		// SEND TO F1
//			}else{
//				// NONAKTIF RELAY
//				relayOff(12);
//				relayOff(13);
//			  LCD_Clear();
//		}
//	}else if(currentSegment[12] > openShortCircuit[12] && currentSegment[12] < thresholdSegment[12]){
//				/* KONDISI AMAN SEGMENT 1*/
//				LCD_Clear();
//				// DATA TO SCADA
//				 dataSeg[12] = 0;
//				sendDataSegment(); 		// SEND TO F1
//				if(currentSegment[13] > openShortCircuit[13] && currentSegment[13] < thresholdSegment[13]){
//					/* KONDISI AMAN SEGMENT 1*/
//					LCD_Clear();
//				  // DATA TO SCADA
//				  dataSeg[13] = 0;
//					sendDataSegment(); 		// SEND TO F1
//				}
//	}else if(currentSegment[13] > openShortCircuit[13] && currentSegment[13] < thresholdSegment[13]){
//				/* KONDISI AMAN SEGMENT 2*/
//				LCD_Clear();
//				// DATA TO SCADA
//				 dataSeg[13] = 0;		
//				sendDataSegment(); 		// SEND TO F1
//				if(currentSegment[12] > openShortCircuit[12] && currentSegment[12] < thresholdSegment[12]){
//					/* KONDISI AMAN SEGMENT 1*/
//					LCD_Clear();
//				  // DATA TO SCADA
//				  dataSeg[12] = 0;
//					sendDataSegment(); 		// SEND TO F1
//				}	
//	}
//	
//	/* ===============SEGMENT 15 DAN 16===================== */
//		if(currentSegment[14] > thresholdSegment[14]){
//			/* PRE ALARM */
//			// PESAN KE LCD
//			LCD_Clear();
//			if(strlen(temp15) >= 2){			//check apabila penamaan zone kosong
//				sprintf(buffer1, "ZONE %s AKTIF",temp15);
//				LCD_Putsxy(0,1, buffer1);
//			}else{
//				LCD_Putsxy(0,1, "Segment 15 AKTIF");
//			}
//			// DATA TO SCADA
//				 dataSeg[14] = 2;
//			// BUZZERR BLINK
//			buzzerBlink(1000);
//			LCD_Clear();
//			sendDataSegment(); 		// SEND TO F1
//		if((currentSegment[14] > thresholdSegment[14]) && (currentSegment[15] > thresholdSegment[15])){
//			/* FIRE ALARM ACTIVE */
//			// AKTIFKAN RELAY 0
//				relayOn(14);
//				relayOn(15);
//			// DATA TO SCADA
//				 dataSeg[14] = 2;
//				 dataSeg[15] = 2;		
//			// PESAN KE LCD
//				if(strlen(temp15) >= 2 && strlen(temp16) >= 2){			//check apabila penamaan zone kosong
//					sprintf(buffer1, "ZONE %s & %s AKTIF",temp15, temp16);
//					LCD_Putsxy(0,1, buffer1);
//				}else{
//					LCD_Putsxy(0,1, "Segment 15 & 16 AKTIF");
//				}
//				DWT_Delayms(1000);
//				sendDataSegment(); 		// SEND TO F1
//			}else{
//				// NONAKTIF RELAY
//				relayOff(14);
//				relayOff(15);
//			  LCD_Clear();
//		}		
//	}else if(currentSegment[15] > thresholdSegment[15]){
//			/* PRE ALARM */
//			// PESAN KE LCD
//			LCD_Clear();
//			if(strlen(temp16) >= 2){			//check apabila penamaan zone kosong
//				sprintf(buffer1, "ZONE %s AKTIF",temp16);
//				LCD_Putsxy(0,1, buffer1);
//			}else{
//				LCD_Putsxy(0,1, "Segment 16 AKTIF");
//			}
//			// DATA TO SCADA
//				 dataSeg[15] = 2;
//			// BUZZERR BLINK
//			buzzerBlink(1000);
//			LCD_Clear();
//			sendDataSegment(); 		// SEND TO F1
//		if((currentSegment[14] > thresholdSegment[14]) && (currentSegment[15] > thresholdSegment[15])){
//			/* FIRE ALARM ACTIVE */
//			// AKTIFKAN RELAY 0
//				relayOn(14);
//				relayOn(15);
//			// DATA TO SCADA
//				 dataSeg[14] = 2;
//				 dataSeg[15] = 2;	
//			// PESAN KE LCD
//				if(strlen(temp15) >= 2 && strlen(temp16) >= 2){			//check apabila penamaan zone kosong
//					sprintf(buffer1, "ZONE %s & %s AKTIF",temp15, temp16);
//					LCD_Putsxy(0,1, buffer1);
//				}else{
//					LCD_Putsxy(0,1, "Segment 15 & 16 AKTIF");
//				}
//				DWT_Delayms(1000);
//				sendDataSegment(); 		// SEND TO F1
//			}else{
//				// NONAKTIF RELAY
//				relayOff(14);
//				relayOff(15);
//			  LCD_Clear();
//		}
//	}else if(currentSegment[14] > openShortCircuit[14] && currentSegment[14] < thresholdSegment[14]){
//				/* KONDISI AMAN SEGMENT 1*/
//				LCD_Clear();
//				// DATA TO SCADA
//				 dataSeg[14] = 0;
//				sendDataSegment(); 		// SEND TO F1
//				if(currentSegment[15] > openShortCircuit[15] && currentSegment[15] < thresholdSegment[15]){
//					/* KONDISI AMAN SEGMENT 1*/
//					LCD_Clear();
//				  // DATA TO SCADA
//				  dataSeg[15] = 0;
//					sendDataSegment(); 		// SEND TO F1
//				}
//	}else if(currentSegment[15] > openShortCircuit[15] && currentSegment[15] < thresholdSegment[15]){
//				/* KONDISI AMAN SEGMENT 2*/
//				LCD_Clear();
//				// DATA TO SCADA
//				 dataSeg[15] = 0;		
//				sendDataSegment(); 		// SEND TO F1
//				if(currentSegment[14] > openShortCircuit[14] && currentSegment[14] < thresholdSegment[14]){
//					/* KONDISI AMAN SEGMENT 1*/
//					LCD_Clear();
//				  // DATA TO SCADA
//				  dataSeg[14] = 0;
//					sendDataSegment(); 		// SEND TO F1
//				}	
//	}
//	
//}
void checkSortAndOpenCircuit(void){
	/* CHECK SHORT CIRCUIT */
	if((currentSegment[0] <= 0) && (currentSegment[1] <= 0) && (currentSegment[2] <= 0) 
		&& (currentSegment[3] <= 0) && (currentSegment[4] <= 0) && (currentSegment[5] <= 0)
		&& (currentSegment[6] <= 0) && (currentSegment[7] <= 0) && (currentSegment[8] <= 0)
		&& (currentSegment[9] <= 0) && (currentSegment[10] <= 0) && (currentSegment[11] <= 0)
	  && (currentSegment[12] <= 0) && (currentSegment[13] <= 0) && (currentSegment[14] <= 0)
	  && (currentSegment[15] <= 0)){
		// PESASN KE LCD
		LCD_Putsxy(0,1, "SENSOR =>SHORT CIRCUIT");
		// BUZZER NOTIF
		buzzerBlink(1000);
		LCD_Clear();
	}
	/* CHECK OPEN CIRCUIT */
	else if(currentSegment[0] < openShortCircuit[0]){
			/* OPEN CIRCUIT SEGMENT 1 */
			// PESAN KE LCD
			LCD_Clear();
			LCD_Putsxy(0, 1, "OPEN CIRCUIT SEG 1");	
			// BUZZER NOTIF
			buzzerBlink(1000);
			LCD_Clear();
	}else if(currentSegment[1] < openShortCircuit[1]){
			/* OPEN CIRCUIT SEGMENT 2 */
			// PESAN KE LCD
			LCD_Clear();
			LCD_Putsxy(0, 1, "OPEN CIRCUIT SEG 2");	
			// BUZZER NOTIF
			buzzerBlink(1000);
			LCD_Clear();
	}else if(currentSegment[2] < openShortCircuit[2]){
			/* OPEN CIRCUIT SEGMENT 1 */
			// PESAN KE LCD
			LCD_Clear();
			LCD_Putsxy(0, 1, "OPEN CIRCUIT SEG 3");	
			// BUZZER NOTIF
			buzzerBlink(1000);
			LCD_Clear();
	}else if(currentSegment[3] < openShortCircuit[3]){
			/* OPEN CIRCUIT SEGMENT 2 */
			// PESAN KE LCD
			LCD_Clear();
			LCD_Putsxy(0, 1, "OPEN CIRCUIT SEG 4");	
			// BUZZER NOTIF
			buzzerBlink(1000);
			LCD_Clear();
	}	else if(currentSegment[4] < openShortCircuit[4]){
			/* OPEN CIRCUIT SEGMENT 1 */
			// PESAN KE LCD
			LCD_Clear();
			LCD_Putsxy(0, 1, "OPEN CIRCUIT SEG 5");	
			// BUZZER NOTIF
			buzzerBlink(1000);
			LCD_Clear();
	}else if(currentSegment[5] < openShortCircuit[5]){
			/* OPEN CIRCUIT SEGMENT 2 */
			// PESAN KE LCD
			LCD_Clear();
			LCD_Putsxy(0, 1, "OPEN CIRCUIT SEG 6");	
			// BUZZER NOTIF
			buzzerBlink(1000);
			LCD_Clear();
	}	else if(currentSegment[6] < openShortCircuit[6]){
			/* OPEN CIRCUIT SEGMENT 1 */
			// PESAN KE LCD
			LCD_Clear();
			LCD_Putsxy(0, 1, "OPEN CIRCUIT SEG 7");	
			// BUZZER NOTIF
			buzzerBlink(1000);
			LCD_Clear();
	}else if(currentSegment[7] < openShortCircuit[7]){
			/* OPEN CIRCUIT SEGMENT 2 */
			// PESAN KE LCD
			LCD_Clear();
			LCD_Putsxy(0, 1, "OPEN CIRCUIT SEG 8");	
			// BUZZER NOTIF
			buzzerBlink(1000);
			LCD_Clear();
	}	else if(currentSegment[8] < openShortCircuit[8]){
			/* OPEN CIRCUIT SEGMENT 1 */
			// PESAN KE LCD
			LCD_Clear();
			LCD_Putsxy(0, 1, "OPEN CIRCUIT SEG 9");	
			// BUZZER NOTIF
			buzzerBlink(1000);
			LCD_Clear();
	}else if(currentSegment[9] < openShortCircuit[9]){
			/* OPEN CIRCUIT SEGMENT 2 */
			// PESAN KE LCD
			LCD_Clear();
			LCD_Putsxy(0, 1, "OPEN CIRCUIT SEG 10");	
			// BUZZER NOTIF
			buzzerBlink(1000);
			LCD_Clear();
	}	else if(currentSegment[10] < openShortCircuit[10]){
			/* OPEN CIRCUIT SEGMENT 1 */
			// PESAN KE LCD
			LCD_Clear();
			LCD_Putsxy(0, 1, "OPEN CIRCUIT SEG 11");	
			// BUZZER NOTIF
			buzzerBlink(1000);
			LCD_Clear();
	}else if(currentSegment[11] < openShortCircuit[11]){
			/* OPEN CIRCUIT SEGMENT 2 */
			// PESAN KE LCD
			LCD_Clear();
			LCD_Putsxy(0, 1, "OPEN CIRCUIT SEG 12");	
			// BUZZER NOTIF
			buzzerBlink(1000);
			LCD_Clear();
	}	else if(currentSegment[12] < openShortCircuit[12]){
			/* OPEN CIRCUIT SEGMENT 1 */
			// PESAN KE LCD
			LCD_Clear();
			LCD_Putsxy(0, 1, "OPEN CIRCUIT SEG 13");	
			// BUZZER NOTIF
			buzzerBlink(1000);
			LCD_Clear();
	}else if(currentSegment[13] < openShortCircuit[13]){
			/* OPEN CIRCUIT SEGMENT 2 */
			// PESAN KE LCD
			LCD_Clear();
			LCD_Putsxy(0, 1, "OPEN CIRCUIT SEG 14");	
			// BUZZER NOTIF
			buzzerBlink(1000);
			LCD_Clear();
	}	else if(currentSegment[14] < openShortCircuit[14]){
			/* OPEN CIRCUIT SEGMENT 1 */
			// PESAN KE LCD
			LCD_Clear();
			LCD_Putsxy(0, 1, "OPEN CIRCUIT SEG 15");	
			// BUZZER NOTIF
			buzzerBlink(1000);
			LCD_Clear();
	}else if(currentSegment[15] < openShortCircuit[15]){
			/* OPEN CIRCUIT SEGMENT 2 */
			// PESAN KE LCD
			LCD_Clear();
			LCD_Putsxy(0, 1, "OPEN CIRCUIT SEG 16");	
			// BUZZER NOTIF
			buzzerBlink(1000);
			LCD_Clear();
	}
}
void backupopen(void){
	if(currentSegment[2] < openShortCircuit[2]){
			/* OPEN CIRCUIT SEGMENT 3 */
			// PESAN KE LCD
			LCD_Putsxy(0, 1, "OPEN CIRCUIT SEG 3");	
			// BUZZER NOTIF
			buzzerBlink(2000);		
	}else if(currentSegment[3] < openShortCircuit[3]){
			/* OPEN CIRCUIT SEGMENT 4 */
			// PESAN KE LCD
			LCD_Putsxy(0, 1, "OPEN CIRCUIT SEG 4");	
			// BUZZER NOTIF
			buzzerBlink(2000);		
	}else if(currentSegment[4] < openShortCircuit[4]){
			/* OPEN CIRCUIT SEGMENT 5 */
			// PESAN KE LCD
			LCD_Putsxy(0, 1, "OPEN CIRCUIT SEG 5");	
			// BUZZER NOTIF
			buzzerBlink(2000);		
	}else if(currentSegment[5] < openShortCircuit[5]){
			/* OPEN CIRCUIT SEGMENT 6 */
			// PESAN KE LCD
			LCD_Putsxy(0, 1, "OPEN CIRCUIT SEG 6");	
			// BUZZER NOTIF
			buzzerBlink(2000);		
	}else if(currentSegment[6] < openShortCircuit[6]){
			/* OPEN CIRCUIT SEGMENT 7 */
			// PESAN KE LCD
			LCD_Putsxy(0, 1, "OPEN CIRCUIT SEG 7");	
			// BUZZER NOTIF
			buzzerBlink(2000);		
	}else if(currentSegment[7] < openShortCircuit[7]){
			/* OPEN CIRCUIT SEGMENT 8 */
			// PESAN KE LCD
			LCD_Putsxy(0, 1, "OPEN CIRCUIT SEG 8");	
			// BUZZER NOTIF
			buzzerBlink(2000);		
	}else if(currentSegment[8] < openShortCircuit[8]){
			/* OPEN CIRCUIT SEGMENT 9 */
			// PESAN KE LCD
			LCD_Putsxy(0, 1, "OPEN CIRCUIT SEG 9");	
			// BUZZER NOTIF
			buzzerBlink(2000);		
	}else if(currentSegment[9] < openShortCircuit[9]){
			/* OPEN CIRCUIT SEGMENT 10 */
			// PESAN KE LCD
			LCD_Putsxy(0, 1, "OPEN CIRCUIT SEG 10");	
			// BUZZER NOTIF
			buzzerBlink(2000);		
	}else if(currentSegment[10] < openShortCircuit[10]){
			/* OPEN CIRCUIT SEGMENT 11 */
			// PESAN KE LCD
			LCD_Putsxy(0, 1, "OPEN CIRCUIT SEG 11");	
			// BUZZER NOTIF
			buzzerBlink(2000);		
	}else if(currentSegment[11] < openShortCircuit[11]){
			/* OPEN CIRCUIT SEGMENT 12 */
			// PESAN KE LCD
			LCD_Putsxy(0, 1, "OPEN CIRCUIT SEG 12");	
			// BUZZER NOTIF
			buzzerBlink(2000);		
	}else if(currentSegment[12] < openShortCircuit[12]){
			/* OPEN CIRCUIT SEGMENT 13 */
			// PESAN KE LCD
			LCD_Putsxy(0, 1, "OPEN CIRCUIT SEG 13");	
			// BUZZER NOTIF
			buzzerBlink(2000);		
	}else if(currentSegment[13] < openShortCircuit[13]){
			/* OPEN CIRCUIT SEGMENT 14 */
			// PESAN KE LCD
			LCD_Putsxy(0, 1, "OPEN CIRCUIT SEG 14");	
			// BUZZER NOTIF
			buzzerBlink(2000);		
	}else if(currentSegment[14] < openShortCircuit[14]){
			/* OPEN CIRCUIT SEGMENT 15 */
			// PESAN KE LCD
			LCD_Putsxy(0, 1, "OPEN CIRCUIT SEG 15");	
			// BUZZER NOTIF
			buzzerBlink(2000);		
	}else if(currentSegment[15] < openShortCircuit[15]){
			/* OPEN CIRCUIT SEGMENT 16 */
			// PESAN KE LCD
			LCD_Putsxy(0, 1, "OPEN CIRCUIT SEG 16");	
			// BUZZER NOTIF
			buzzerBlink(2000);				
	}
	
	
	/* BACKUP MODE CROSS WIRE */
		/* ===============SEGMENT 3 DAN 4===================== */
		if(currentSegment[2] > thresholdSegment[2]){
			/* PRE ALARM */
			// PESAN KE LCD
			LCD_Putsxy(0,1,"SEGMENT 3 ACTIVE");
			// BUZZERR BLINK
			buzzerBlink(2000);
		if((currentSegment[2] > thresholdSegment[2]) && (currentSegment[3] > thresholdSegment[3])){
			/* FIRE ALARM ACTIVE */
			// AKTIFKAN RELAY 0
				relayOn(2);
				relayOn(3);
			// USART TO SCADA
		
			// PESAN KE LCD
				LCD_Putsxy(0,1, "SEGMENT 3 & 4 ACTIVE");
				DWT_Delayms(2000);
			}else{
				// NONAKTIF RELAY
				relayOff(2);
				relayOff(3);
		}		
	}else if(currentSegment[3] > thresholdSegment[3]){
			/* PRE ALARM */
			// PESAN KE LCD
			LCD_Putsxy(0,1,"SEGMENT 4 ACTIVE");
			// BUZZERR BLINK
			buzzerBlink(2000);
		if((currentSegment[2] > thresholdSegment[2]) && (currentSegment[3] > thresholdSegment[3])){
			/* FIRE ALARM ACTIVE */
			// AKTIFKAN RELAY 0
				relayOn(2);
				relayOn(3);
			// USART TO SCADA
		
			// PESAN KE LCD
				LCD_Putsxy(0,1, "SEGMENT 3 & 4 ACTIVE");
				DWT_Delayms(2000);
			}else{
				// NONAKTIF RELAY
				relayOff(2);
				relayOff(3);
		}
	}
	/* ===============SEGMENT 5 DAN 6===================== */
		if(currentSegment[4] > thresholdSegment[4]){
			/* PRE ALARM */
			// PESAN KE LCD
			LCD_Putsxy(0,1,"SEGMENT 5 ACTIVE");
			// BUZZERR BLINK
			buzzerBlink(2000);
		if((currentSegment[4] > thresholdSegment[4]) && (currentSegment[5] > thresholdSegment[5])){
			/* FIRE ALARM ACTIVE */
			// AKTIFKAN RELAY 0
				relayOn(4);
				relayOn(5);
			// USART TO SCADA
		
			// PESAN KE LCD
				LCD_Putsxy(0,1, "SEGMENT 5 & 6 ACTIVE");
				DWT_Delayms(2000);
			}else{
				// NONAKTIF RELAY
				relayOff(4);
				relayOff(5);
		}		
	}else if(currentSegment[5] > thresholdSegment[5]){
			/* PRE ALARM */
			// PESAN KE LCD
			LCD_Putsxy(0,1,"SEGMENT 6 ACTIVE");
			// BUZZERR BLINK
			buzzerBlink(2000);
		if((currentSegment[4] > thresholdSegment[4]) && (currentSegment[5] > thresholdSegment[5])){
			/* FIRE ALARM ACTIVE */
			// AKTIFKAN RELAY 0
				relayOn(4);
				relayOn(5);
			// USART TO SCADA
		
			// PESAN KE LCD
				LCD_Putsxy(0,1, "SEGMENT 5 & 6 ACTIVE");
				DWT_Delayms(2000);
			}else{
				// NONAKTIF RELAY
				relayOff(4);
				relayOff(5);
		}
	}
	/* ===============SEGMENT 7 DAN 8===================== */
		if(currentSegment[6] > thresholdSegment[6]){
			/* PRE ALARM */
			// PESAN KE LCD
			LCD_Putsxy(0,1,"SEGMENT 7 ACTIVE");
			// BUZZERR BLINK
			buzzerBlink(2000);
		if((currentSegment[6] > thresholdSegment[6]) && (currentSegment[7] > thresholdSegment[7])){
			/* FIRE ALARM ACTIVE */
			// AKTIFKAN RELAY 0
				relayOn(6);
				relayOn(7);
			// USART TO SCADA
		
			// PESAN KE LCD
				LCD_Putsxy(0,1, "SEGMENT 7 & 8 ACTIVE");
				DWT_Delayms(2000);
			}else{
				// NONAKTIF RELAY
				relayOff(6);
				relayOff(7);
		}		
	}else if(currentSegment[7] > thresholdSegment[7]){
			/* PRE ALARM */
			// PESAN KE LCD
			LCD_Putsxy(0,1,"SEGMENT 8 ACTIVE");
			// BUZZERR BLINK
			buzzerBlink(2000);
		if((currentSegment[6] > thresholdSegment[6]) && (currentSegment[7] > thresholdSegment[7])){
			/* FIRE ALARM ACTIVE */
			// AKTIFKAN RELAY 0
				relayOn(6);
				relayOn(7);
			// USART TO SCADA
		
			// PESAN KE LCD
				LCD_Putsxy(0,1, "SEGMENT 7 & 8 ACTIVE");
				DWT_Delayms(2000);
			}else{
				// NONAKTIF RELAY
				relayOff(6);
				relayOff(7);
		}
	}
	/* ===============SEGMENT 9 DAN 10===================== */
		if(currentSegment[8] > thresholdSegment[8]){
			/* PRE ALARM */
			// PESAN KE LCD
			LCD_Putsxy(0,1,"SEGMENT 9 ACTIVE");
			// BUZZERR BLINK
			buzzerBlink(2000);
		if((currentSegment[8] > thresholdSegment[8]) && (currentSegment[9] > thresholdSegment[9])){
			/* FIRE ALARM ACTIVE */
			// AKTIFKAN RELAY 0
				relayOn(8);
				relayOn(9);
			// USART TO SCADA
		
			// PESAN KE LCD
				LCD_Putsxy(0,1, "SEGMENT 9 & 10 ACTIVE");
				DWT_Delayms(2000);
			}else{
				// NONAKTIF RELAY
				relayOff(8);
				relayOff(9);
		}		
	}else if(currentSegment[9] > thresholdSegment[9]){
			/* PRE ALARM */
			// PESAN KE LCD
			LCD_Putsxy(0,1,"SEGMENT 10 ACTIVE");
			// BUZZERR BLINK
			buzzerBlink(2000);
		if((currentSegment[8] > thresholdSegment[8]) && (currentSegment[9] > thresholdSegment[9])){
			/* FIRE ALARM ACTIVE */
			// AKTIFKAN RELAY 0
				relayOn(8);
				relayOn(9);
			// USART TO SCADA
		
			// PESAN KE LCD
				LCD_Putsxy(0,1, "SEGMENT 9 & 10 ACTIVE");
				DWT_Delayms(2000);
			}else{
				// NONAKTIF RELAY
				relayOff(8);
				relayOff(9);
		}
	}
	
	
	
	
	
	
	
	
	/* ===============SEGMENT 11 DAN 12===================== */
		if(currentSegment[10] > thresholdSegment[10]){
			/* PRE ALARM */
			// PESAN KE LCD
			LCD_Putsxy(0,1,"SEGMENT 11 ACTIVE");
			// BUZZERR BLINK
			buzzerBlink(2000);
		if((currentSegment[10] > thresholdSegment[10]) && (currentSegment[11] > thresholdSegment[11])){
			/* FIRE ALARM ACTIVE */
			// AKTIFKAN RELAY 0
				relayOn(10);
				relayOn(11);
			// USART TO SCADA
		
			// PESAN KE LCD
				LCD_Putsxy(0,1, "SEGMENT 11 & 12 ACTIVE");
				DWT_Delayms(2000);
			}else{
				// NONAKTIF RELAY
				relayOff(10);
				relayOff(11);
		}		
	}else if(currentSegment[11] > thresholdSegment[11]){
			/* PRE ALARM */
			// PESAN KE LCD
			LCD_Putsxy(0,1,"SEGMENT 12 ACTIVE");
			// BUZZERR BLINK
			buzzerBlink(2000);
		if((currentSegment[10] > thresholdSegment[10]) && (currentSegment[11] > thresholdSegment[11])){
			/* FIRE ALARM ACTIVE */
			// AKTIFKAN RELAY 0
				relayOn(10);
				relayOn(11);
			// USART TO SCADA
		
			// PESAN KE LCD
				LCD_Putsxy(0,1, "SEGMENT 11 & 12 ACTIVE");
				DWT_Delayms(2000);
			}else{
				// NONAKTIF RELAY
				relayOff(10);
				relayOff(11);
		}
	}





