rizkyzullfhamy/FireAlarm_Mutant_STM32F4/MDK-ARM/SENSOR.c
	/* ===============SEGMENT 13 DAN 14===================== */
		if(currentSegment[12] > thresholdSegment[13]){
			/* PRE ALARM */
			// PESAN KE LCD
			LCD_Putsxy(0,1,"SEGMENT 13 ACTIVE");
			// BUZZERR BLINK
			buzzerBlink(2000);
		if((currentSegment[12] > thresholdSegment[12]) && (currentSegment[13] > thresholdSegment[13])){
			/* FIRE ALARM ACTIVE */
			// AKTIFKAN RELAY 0
				relayOn(12);
				relayOn(13);
			// USART TO SCADA
		
			// PESAN KE LCD
				LCD_Putsxy(0,1, "SEGMENT 13 & 14 ACTIVE");
				DWT_Delayms(2000);
			}else{
				// NONAKTIF RELAY
				relayOff(12);
				relayOff(13);
		}		
	}else if(currentSegment[13] > thresholdSegment[13]){
			/* PRE ALARM */
			// PESAN KE LCD
			LCD_Putsxy(0,1,"SEGMENT 14 ACTIVE");
			// BUZZERR BLINK
			buzzerBlink(2000);
		if((currentSegment[12] > thresholdSegment[12]) && (currentSegment[13] > thresholdSegment[13])){
			/* FIRE ALARM ACTIVE */
			// AKTIFKAN RELAY 0
				relayOn(12);
				relayOn(13);
			// USART TO SCADA
		
			// PESAN KE LCD
				LCD_Putsxy(0,1, "SEGMENT 11 & 12 ACTIVE");
				DWT_Delayms(2000);
			}else{
				// NONAKTIF RELAY
				relayOff(12);
				relayOff(13);
		}
	}
	/* ===============SEGMENT 15 DAN 16===================== */
		if(currentSegment[14] > thresholdSegment[14]){
			/* PRE ALARM */
			// PESAN KE LCD
			LCD_Putsxy(0,1,"SEGMENT 15 ACTIVE");
			// BUZZERR BLINK
			buzzerBlink(2000);
		if((currentSegment[14] > thresholdSegment[14]) && (currentSegment[15] > thresholdSegment[15])){
			/* FIRE ALARM ACTIVE */
			// AKTIFKAN RELAY 0
				relayOn(14);
				relayOn(15);
			// USART TO SCADA
		
			// PESAN KE LCD
				LCD_Putsxy(0,1, "SEGMENT 15 & 16 ACTIVE");
				DWT_Delayms(2000);
			}else{
				// NONAKTIF RELAY
				relayOff(14);
				relayOff(15);
		}		
	}else if(currentSegment[15] > thresholdSegment[15]){
			/* PRE ALARM */
			// PESAN KE LCD
			LCD_Putsxy(0,1,"SEGMENT 16 ACTIVE");
			// BUZZERR BLINK
			buzzerBlink(2000);
		if((currentSegment[14] > thresholdSegment[14]) && (currentSegment[15] > thresholdSegment[15])){
			/* FIRE ALARM ACTIVE */
			// AKTIFKAN RELAY 0
				relayOn(14);
				relayOn(15);
			// USART TO SCADA
		
			// PESAN KE LCD
				LCD_Putsxy(0,1, "SEGMENT 15 & 16 ACTIVE");
				DWT_Delayms(2000);
			}else{
				// NONAKTIF RELAY
				relayOff(14);
				relayOff(15);
		}
	}
}
void checkOverCurrentSensor(void){
	if(currentSegment[0] > currentOverSensor){limitOn(0);}
	if(currentSegment[1] > currentOverSensor){limitOn(1);}
	if(currentSegment[2] > currentOverSensor){limitOn(2);}
	if(currentSegment[3] > currentOverSensor){limitOn(3);}
	if(currentSegment[4] > currentOverSensor){limitOn(4);}
	if(currentSegment[5] > currentOverSensor){limitOn(5);}
	if(currentSegment[6] > currentOverSensor){limitOn(6);}
	if(currentSegment[7] > currentOverSensor){limitOn(7);}
	if(currentSegment[8] > currentOverSensor){limitOn(8);}
	if(currentSegment[9] > currentOverSensor){limitOn(9);}
	if(currentSegment[10] > currentOverSensor){limitOn(10);}
	if(currentSegment[11] > currentOverSensor){limitOn(11);}
	if(currentSegment[12] > currentOverSensor){limitOn(12);}
	if(currentSegment[13] > currentOverSensor){limitOn(13);}
	if(currentSegment[14] > currentOverSensor){limitOn(14);}
	if(currentSegment[15] > currentOverSensor){limitOn(15);}
}



















